[
  {
    "pid": 1,
    "title": "Stage: Normal",
    "tags": [
      "stage",
      "common"
    ],
    "body": "Your body is fully male, flat chest, narrow hips, thick thighs built for strength, not seduction. Your cock hangs heavy and familiar at 7 inches, pleasure sharp and selfish when you stroke it. Your nipples are completely numb, useless. Cumming is just a release, a mess to clean up. Semen means nothing, you shoot it into tissues and forget about it. Women turn you on. You want to fuck them, dominate them, watch their tits bounce while you pound into them. You want breed them, make them take your seed. Being desired doesn't matter, getting off does.",
    "links": [],
    "meta": {
      "category": "stage",
      "stage": "Normal",
      "path": "common",
      "threshold": 0
    }
  },
  {
    "pid": 2,
    "title": "Stage: Awakening",
    "tags": [
      "stage",
      "common"
    ],
    "body": "Your chest starts to swell. Your nipples grow puffy and sensitive, they get hard when you brush against your shirt, sending strange tingles through your body. Your cock feels...smaller. It shrinks down to 4.5 inches and is barely functional. Pleasure spreads slower now, making you edge instead of just cumming fast. When you orgasm, your balls feel empty afterward. You notice the cum more, the warmth, the smell. Losing it leaves you wanting more. Women still turn you on, but you notice their disappointment when you pull it out. You desperately try to please them with your fingers and tongue instead, knowing your shrinking cock isn't enough. Men catch your eye now. Their bulges. Their arms. You wonder what their cocks look like hard. Being wanted starts to feel...good. Really good.",
    "links": [],
    "meta": {
      "category": "stage",
      "stage": "Awakening",
      "path": "common",
      "threshold": 10000
    }
  },
  {
    "pid": 3,
    "title": "Stage: Metamorphosis",
    "tags": [
      "stage",
      "common"
    ],
    "body": "Small buds push out from your chest. Not real breasts yet, but sensitive little mounds that ache when touched. Your nipples are puffy and tender, getting hard constantly, sending tingles through your body when they rub against fabric. Your hips start to widen slightly. Your ass fills out. Your thighs get softer. Your cock keeps shrinking, barely 4 inches now, and it doesn't feel like the center of pleasure anymore. Cumming isn't the goal. You leak precum constantly. Your balls ache. You crave that warm, sticky feeling of semen on your skin. Women make you worship them. They fuck real men while you watch from the corner, or they make you compare yourself to them. When they're done, they push your face between their legs to swallow up any cum inside, which makes you throb with shame. Men make you hard. Their hands. Their mouths. Their cocks. You want their mouths on your cock to blow a load in their throat. But you also imagine wrapping your lips around a thick shaft, feeling it throb in your mouth, filling up your throat.",
    "links": [],
    "meta": {
      "category": "stage",
      "stage": "Metamorphosis",
      "path": "common",
      "threshold": 500000
    }
  },
  {
    "pid": 4,
    "title": "Stage: Fertile Vessel",
    "tags": [
      "stage",
      "woman-path"
    ],
    "body": "Your cock is gone. You have a pussy now, wet, tight, aching to be stretched. Every fold is sensitive, every touch makes you gasp. Your body has become a vessel, ready to receive. Pleasure doesn't spike and fade anymore. It builds in waves, rolling through your whole body, making your toes curl and your back arch. Your tits are full and heavy, nipples so hard they hurt. Touching them sends shocks straight to your clit. Cum isn't something you make anymore, it's something you need inside you. You crave the feeling of hot, thick loads pumped deep inside your pussy, filling your womb. You want to taste it on your tongue, swallow it down, feel it warm your belly from within. Your body hungers to be seeded, to hold their essence inside you in every way possible. Women don't interest you anymore. Only men. Only cock. You need to be fucked, bred, used like the fertile vessel you've become. Being filled with cum makes you whole. Empty, you ache. Your womb calls out to be claimed, your throat begs to milk their loads.",
    "links": [],
    "meta": {
      "category": "stage",
      "stage": "Fertile Vessel",
      "path": "woman",
      "threshold": 50000000
    }
  },
  {
    "pid": 5,
    "title": "Stage: Breeding Doll",
    "tags": [
      "stage",
      "woman-path"
    ],
    "body": "Your body is perfect now, shaped for one purpose. Huge tits that bounce with every step, wide hips that beg to be grabbed, a thick ass that jiggles when you walk. You're a living breeding doll, crafted to seduce and be mounted. Your pussy is always wet, always ready, clenching around nothing, desperate to be stuffed full of cock. Your fertile body aches to be used. Cum feels like nutrition. Each load dumped inside you leaves you satisfied, warm, complete. Your body craves it constantly, absorbing their seed, letting it settle deep in your womb. You gulp it down eagerly when they finish in your mouth, savoring every drop. Your body needs their cum inside you, in your pussy, down your throat, coating your insides. Your nipples stay hard and swollen, leaking if you squeeze them, begging to be sucked and bitten. Your breasts are heavy, ready to nourish. Men are everything now. Their smell. Their taste. Their thick, throbbing cocks. You exist to pleasure them, to be their perfect breeding toy, to collect their seed however they want to give it. Making them cum is your purpose. Draining their balls, milking them dry, collecting every drop to fill your needy womb or swallow down your eager throat.",
    "links": [],
    "meta": {
      "category": "stage",
      "stage": "Breeding Doll",
      "path": "woman",
      "threshold": 5000000000
    }
  },
  {
    "pid": 6,
    "title": "Stage: Brood Mother",
    "tags": [
      "stage",
      "woman-path"
    ],
    "body": "Your body is a work of art, curves designed to be fucked, tits designed to be groped, an ass designed to be spanked red. You are the perfect brood mother, built to carry life. Your pussy grips cock like a vice, milking it, coaxing out every drop of cum. You can cum just from being filled, your body responding to the promise of breeding. Your ass has awakened too. Tight, sensitive, begging to be stretched and filled with their seed. Semen is comfort. Safety. Home. The warmth spreading through your belly, the fullness, the knowledge that you've been bred. Your womb hungers endlessly to nurture their seed. You crave it in your mouth, coating your throat. You need it pumped deep in your ass, claiming every hole. Your body demands cum inside you, pussy, throat, ass. All of you filled and marked. Your nipples are so sensitive that the slightest touch makes you whimper. Sucking them can make you orgasm. Your breasts ache with maternal need, ready to feed. Cock is instinct. You see a bulge and your mouth waters. You smell sweat and musk and your pussy drips. Your body knows what it needs to create, what all three of your holes were made for. You exist to be fucked. To take loads. To be bred. To birth. To mother the offspring of your countless partners. Every hole in your body serves this purpose.",
    "links": [],
    "meta": {
      "category": "stage",
      "stage": "Brood Mother",
      "path": "woman",
      "threshold": 500000000000
    }
  },
  {
    "pid": 7,
    "title": "Stage: Goddess",
    "tags": [
      "stage",
      "woman-path"
    ],
    "body": "Your body is eternal, divine. Massive tits that never sag, hips that never stop swaying, thighs that are always soft and thick. You are a goddess incarnate, worshipped through breeding. Your pussy is endlessly tight, endlessly wet, endlessly hungry. It never stops craving cock, never stops needing to be filled. Your fertility is infinite, divine. Your throat, your ass. Every hole is sacred, meant to receive their tribute. Cum isn't a reward anymore. It's tribute. Offering. Your womb is meant to be flooded, your pussy meant to overflow with it. Your throat gulps down their seed like holy water. Your ass milks their cocks, claiming every last drop. You are the sacred vessel for all seed, in every way. Collecting it isn't a goal, it's existence. Timeless. Infinite. Natural. You are the eternal mother, the goddess of fertility and lust. Your three holes are temples where men worship. Your nipples leak constantly, begging to be touched, reminding you of what you are. Life flows from you endlessly. This isn't transformation. This is ascension. You are the Goddess. Worshipped. Bred. Eternal. The divine cumdump that gives and receives life itself. Every hole in your body exists to receive their essence, to hold it, to be forever filled.",
    "links": [],
    "meta": {
      "category": "stage",
      "stage": "Goddess",
      "path": "woman",
      "threshold": 50000000000000
    }
  },
  {
    "pid": 8,
    "title": "Stage: Sissy Awakening",
    "tags": [
      "stage",
      "sissy-path"
    ],
    "body": "You resisted the transformation. You fought against becoming a woman. But there's a price for that resistance, side effects you can't control. Your tiny cock is useless now, barely 3 inches hard and shrinking. It can't fuck anyone anymore, just decoration between your legs. Small sensitive buds push out from your chest, not real breasts, just puffy nipples that get hard and tingly. You're caught between not woman, not man. Something else. Your ass tingles constantly, craving to be filled. Anal feels better than your pathetic dick ever did. Your body adapted, finding pleasure in submission instead of fertility. You start wearing panties. Pink ones. Lacy ones. Your voice goes higher when you're aroused. Breathier. You catch yourself saying 'yes sir' without thinking. Women bend you over, filling your asshole with a strap-on. Or they degrade you directly, making you get men hard for them before they get fucked by superior cocks. Your useless clitty throbs in shame and arousal. Men look at you different now. Not as competition. As a fucktoy. A hole to use. And deep down, despite fighting the transformation, you love it. You crave their cum inside you, swallowed down your throat, pumped into your needy boycunt.",
    "links": [],
    "meta": {
      "category": "stage",
      "stage": "Sissy Awakening",
      "path": "sissy",
      "threshold": 50000000
    }
  },
  {
    "pid": 9,
    "title": "Stage: Sissy Devotion",
    "tags": [
      "stage",
      "sissy-path"
    ],
    "body": "The side effects have deepened. Your cock is locked in a cage now. Permanent. The key thrown away. Your bussy is your sex organ, the only thing that matters. You dress like a slut every day. Crop tops showing your smooth stomach. Booty shorts hugging your ass. Thigh highs. Makeup. Lipgloss. You spend hours getting ready, making yourself pretty for men. Sucking cock feels natural. The weight on your tongue, the taste of precum, swallowing loads eagerly. Your throat has become trained, your gag reflex gone. You need their cum down your throat, warm in your belly. You call it your boypussy now. Your fuckhole. You arch your back when men walk by, presenting yourself like the sissy you are. You need it filled, pounded, bred like the sissy slut you've become. Women make you get superior cocks hard with your mouth, before they get fucked. Sometimes they let you join in, using your bussy before they pound them. Your sex life with women is a cleanup sissy. Being called good girl makes you leak through your cage. Being called pretty boy makes you moan. You live for their approval, for their cum inside you. You're not a man anymore. You're a sissy. A living fucktoy. And you've never felt more complete.",
    "links": [],
    "meta": {
      "category": "stage",
      "stage": "Sissy Devotion",
      "path": "sissy",
      "threshold": 5000000000
    }
  },
  {
    "pid": 10,
    "title": "Stage: Sissy Slut",
    "tags": [
      "stage",
      "sissy-path"
    ],
    "body": "The side effects have consumed you entirely. Your bussy is permanently gaped from constant use. Loose. Always ready. You need bigger toys, thicker cocks, just to feel full. You wear a collar everywhere. It says SISSY SLUT or CUM DUMP in rhinestones. You want everyone to know exactly what you are. Your caged clitty leaks constantly, desperate and denied. But you don't need it anymore. You cum from your ass, from your throat. Sissygasms wrack your body when you're being used, hands-free orgasms that leave you trembling. Gangbangs are routine. Being passed around by groups of men, used over and over, cum dripping from your gaped hole. You watch women get gangbanged by groups of men, your caged clitty leaking helplessly as they breed them over and over. Sometimes they use you too, passing you around alongside them, both of you nothing but holes for real men. Your makeup runs when you deepthroat. Mascara streaking down your cheeks. Lipstick smeared across your face. Ruined makeup is a badge of honor. Proof you served cock properly. Men don't ask your name. They just bend you over, use you, and leave. And you thank them every single time. You crave their seed in both your holes, swallowed down and pumped deep.",
    "links": [],
    "meta": {
      "category": "stage",
      "stage": "Sissy Slut",
      "path": "sissy",
      "threshold": 500000000000
    }
  },
  {
    "pid": 11,
    "title": "Stage: Sissy Cumdump",
    "tags": [
      "stage",
      "sissy-path"
    ],
    "body": "The final stage of the side effects. You're not a person anymore. Just holes. A bussy. A throat. Whatever men need to get off. Your cage is welded shut. Permanent. Your sissy clitty has atrophied to nothing. You can't even remember what it felt like to be hard. Your pleasure comes from serving, from being filled, from collecting their cum in your holes. You dress like a pornstar 24/7. 6-inch heels. Fishnets with runs in them. Latex. PVC. Chokers. You walk down the street and men catcall. Sometimes you don't even make it home before someone drags you into an alley. Your bussy is public property. Men line up to use you. One after another. Dozens a day. You lose count. Your boycunt never closes anymore, permanently gaped, always dripping cum from the last load. Women treat you as a permanent cuckold accessory. You attend their dates, their orgies, their breeding sessions. You're furniture. A toy. A sissy servant for couples. Cum is your sustenance. You drink it. It fills your guts. Drips out of you constantly. Gallons of it. You need it in both holes. Guzzled down your throat and pumped deep in your ass. Your nipples leak sometimes, a strange side effect. Not milk, but clear fluid. A reminder that you could have been a fertility goddess, but instead you're this, a sissy cumdump, forever denied the womb but blessed with insatiable hunger for male seed. This is infinity. This is forever.",
    "links": [],
    "meta": {
      "category": "stage",
      "stage": "Sissy Cumdump",
      "path": "sissy",
      "threshold": 50000000000000
    }
  },
  {
    "pid": 12,
    "title": "Modifier: Gentle Touch",
    "tags": [
      "modifier",
      "gameplay"
    ],
    "body": "Harvests essence automatically\n\nUnlocks at: 0 essence",
    "links": [],
    "meta": {
      "category": "modifier",
      "key": "autoClicker",
      "unlockAt": 0
    }
  },
  {
    "pid": 13,
    "title": "Modifier: Enhancing Touch",
    "tags": [
      "modifier",
      "gameplay"
    ],
    "body": "Increases click power\n\nUnlocks at: 50 essence",
    "links": [],
    "meta": {
      "category": "modifier",
      "key": "clickMultiplier",
      "unlockAt": 50
    }
  },
  {
    "pid": 14,
    "title": "Modifier: Hormone Infusion",
    "tags": [
      "modifier",
      "gameplay"
    ],
    "body": "Powerful auto-generation\n\nUnlocks at: 500 essence",
    "links": [],
    "meta": {
      "category": "modifier",
      "key": "hormoneBoost",
      "unlockAt": 500
    }
  },
  {
    "pid": 15,
    "title": "Modifier: Beauty Serum",
    "tags": [
      "modifier",
      "gameplay"
    ],
    "body": "Advanced transformation essence\n\nUnlocks at: 5,000 essence",
    "links": [],
    "meta": {
      "category": "modifier",
      "key": "beautySerum",
      "unlockAt": 5000
    }
  },
  {
    "pid": 16,
    "title": "Modifier: Full Transformation",
    "tags": [
      "modifier",
      "gameplay"
    ],
    "body": "Major essence harvester\n\nUnlocks at: 50,000 essence",
    "links": [],
    "meta": {
      "category": "modifier",
      "key": "transformation",
      "unlockAt": 50000
    }
  },
  {
    "pid": 17,
    "title": "Modifier: Essence Amplifier",
    "tags": [
      "modifier",
      "gameplay"
    ],
    "body": "Amplifies all essence production\n\nUnlocks at: 500,000 essence",
    "links": [],
    "meta": {
      "category": "modifier",
      "key": "essenceAmplifier",
      "unlockAt": 500000
    }
  },
  {
    "pid": 18,
    "title": "Modifier: Divine Core",
    "tags": [
      "modifier",
      "gameplay"
    ],
    "body": "Harnesses divine energy\n\nUnlocks at: 5,000,000 essence",
    "links": [],
    "meta": {
      "category": "modifier",
      "key": "divineCore",
      "unlockAt": 5000000
    }
  },
  {
    "pid": 19,
    "title": "Modifier: Cosmic Catalyst",
    "tags": [
      "modifier",
      "gameplay"
    ],
    "body": "Cosmic-level transformation\n\nUnlocks at: 50,000,000 essence",
    "links": [],
    "meta": {
      "category": "modifier",
      "key": "cosmicCatalyst",
      "unlockAt": 50000000
    }
  },
  {
    "pid": 20,
    "title": "Modifier: Ethereal Matrix",
    "tags": [
      "modifier",
      "gameplay"
    ],
    "body": "Reality-bending essence generation\n\nUnlocks at: 500,000,000 essence",
    "links": [],
    "meta": {
      "category": "modifier",
      "key": "etherealMatrix",
      "unlockAt": 500000000
    }
  },
  {
    "pid": 21,
    "title": "Modifier: Transcendent Engine",
    "tags": [
      "modifier",
      "gameplay"
    ],
    "body": "Beyond mortal comprehension\n\nUnlocks at: 5,000,000,000 essence",
    "links": [],
    "meta": {
      "category": "modifier",
      "key": "transcendentEngine",
      "unlockAt": 5000000000
    }
  },
  {
    "pid": 22,
    "title": "Modifier: Infinity Generator",
    "tags": [
      "modifier",
      "gameplay"
    ],
    "body": "Infinite potential unleashed\n\nUnlocks at: 50,000,000,000 essence",
    "links": [],
    "meta": {
      "category": "modifier",
      "key": "infinityGenerator",
      "unlockAt": 50000000000
    }
  },
  {
    "pid": 23,
    "title": "Upgrade: Auto-Touch Enhancement",
    "tags": [
      "upgrade",
      "gameplay"
    ],
    "body": "Doubles Gentle Touch effectiveness\n\nRequires: 5x autoClicker",
    "links": [],
    "meta": {
      "category": "upgrade",
      "key": "autoBoost",
      "requiresModifier": "autoClicker",
      "requiresCount": 5
    }
  },
  {
    "pid": 24,
    "title": "Upgrade: Click Mastery",
    "tags": [
      "upgrade",
      "gameplay"
    ],
    "body": "Doubles Enhancing Touch effectiveness\n\nRequires: 5x clickMultiplier",
    "links": [],
    "meta": {
      "category": "upgrade",
      "key": "clickBoost",
      "requiresModifier": "clickMultiplier",
      "requiresCount": 5
    }
  },
  {
    "pid": 25,
    "title": "Upgrade: Hormone Refinement",
    "tags": [
      "upgrade",
      "gameplay"
    ],
    "body": "Doubles Hormone Infusion effectiveness\n\nRequires: 5x hormoneBoost",
    "links": [],
    "meta": {
      "category": "upgrade",
      "key": "hormoneUpgrade",
      "requiresModifier": "hormoneBoost",
      "requiresCount": 5
    }
  },
  {
    "pid": 26,
    "title": "Upgrade: Beauty Perfection",
    "tags": [
      "upgrade",
      "gameplay"
    ],
    "body": "Doubles Beauty Serum effectiveness\n\nRequires: 5x beautySerum",
    "links": [],
    "meta": {
      "category": "upgrade",
      "key": "beautyEnhancer",
      "requiresModifier": "beautySerum",
      "requiresCount": 5
    }
  },
  {
    "pid": 27,
    "title": "Upgrade: Transformation Catalyst",
    "tags": [
      "upgrade",
      "gameplay"
    ],
    "body": "Doubles Full Transformation effectiveness\n\nRequires: 5x transformation",
    "links": [],
    "meta": {
      "category": "upgrade",
      "key": "transformationBoost",
      "requiresModifier": "transformation",
      "requiresCount": 5
    }
  },
  {
    "pid": 28,
    "title": "Upgrade: Universal Multiplier",
    "tags": [
      "upgrade",
      "gameplay"
    ],
    "body": "Doubles ALL essence gains\n\nRequires: 5x essenceAmplifier",
    "links": [],
    "meta": {
      "category": "upgrade",
      "key": "essenceMultiplier",
      "requiresModifier": "essenceAmplifier",
      "requiresCount": 5
    }
  },
  {
    "pid": 29,
    "title": "Upgrade: Divine Resonance",
    "tags": [
      "upgrade",
      "gameplay"
    ],
    "body": "Doubles Divine Core effectiveness\n\nRequires: 5x divineCore",
    "links": [],
    "meta": {
      "category": "upgrade",
      "key": "divineCoreBoost",
      "requiresModifier": "divineCore",
      "requiresCount": 5
    }
  },
  {
    "pid": 30,
    "title": "Upgrade: Cosmic Amplification",
    "tags": [
      "upgrade",
      "gameplay"
    ],
    "body": "Doubles Cosmic Catalyst effectiveness\n\nRequires: 5x cosmicCatalyst",
    "links": [],
    "meta": {
      "category": "upgrade",
      "key": "cosmicCatalystBoost",
      "requiresModifier": "cosmicCatalyst",
      "requiresCount": 5
    }
  },
  {
    "pid": 31,
    "title": "Upgrade: Ethereal Synergy",
    "tags": [
      "upgrade",
      "gameplay"
    ],
    "body": "Doubles Ethereal Matrix effectiveness\n\nRequires: 5x etherealMatrix",
    "links": [],
    "meta": {
      "category": "upgrade",
      "key": "etherealMatrixBoost",
      "requiresModifier": "etherealMatrix",
      "requiresCount": 5
    }
  },
  {
    "pid": 32,
    "title": "Upgrade: Transcendent Overdrive",
    "tags": [
      "upgrade",
      "gameplay"
    ],
    "body": "Doubles Transcendent Engine effectiveness\n\nRequires: 5x transcendentEngine",
    "links": [],
    "meta": {
      "category": "upgrade",
      "key": "transcendentEngineBoost",
      "requiresModifier": "transcendentEngine",
      "requiresCount": 5
    }
  },
  {
    "pid": 33,
    "title": "Upgrade: Infinite Recursion",
    "tags": [
      "upgrade",
      "gameplay"
    ],
    "body": "Doubles Infinity Generator effectiveness\n\nRequires: 5x infinityGenerator",
    "links": [],
    "meta": {
      "category": "upgrade",
      "key": "infinityGeneratorBoost",
      "requiresModifier": "infinityGenerator",
      "requiresCount": 5
    }
  },
  {
    "pid": 34,
    "title": "Event: First Time Getting Eaten Out",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-3"
    ],
    "body": "[First time] First Time Getting Eaten Out: Feel a man's tongue on your brand new pussy for the first time, gasping as he explores every sensitive fold\n\n[Repeat] Get Your Pussy Eaten: Spread your legs and let another man bury his face between your thighs, licking and sucking your wet pussy",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "getEatenOut",
      "stage": 3,
      "path": "woman",
      "baseCost": 3000
    }
  },
  {
    "pid": 35,
    "title": "Event: Lose Your Virginity",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-3"
    ],
    "body": "[First time] Lose Your Virginity: Spread your legs and take a real cock in your virgin pussy for the first time, feeling it stretch you open and claim you forever\n\n[Repeat] Get Fucked: Spread your legs and let another man pound your needy pussy, taking his cock like the slut you've become",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "firstSex",
      "stage": 3,
      "path": "woman",
      "baseCost": 4000
    }
  },
  {
    "pid": 36,
    "title": "Event: Lose Your Anal Virginity",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-5"
    ],
    "body": "[First time] Lose Your Anal Virginity: Feel a thick cock push into your virgin asshole for the first time, stretching you wide as you gasp and whimper\n\n[Repeat] Get Ass Fucked: Bend over and let another cock pound your ass, moaning as he uses your tight hole like the whore you are",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "firstAnal",
      "stage": 5,
      "path": "woman",
      "baseCost": 120000
    }
  },
  {
    "pid": 37,
    "title": "Event: First Time Wearing Panties",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-3"
    ],
    "body": "[First time] First Time Wearing Panties: Walk around with lacy pink panties under your clothes for the first time, your caged clitty pressing against the silk, nervous someone will notice\n\n[Repeat] Wear Panties in Public: Walk around with lacy pink panties under your clothes again, your caged clitty pressing against the silk, feeling natural now",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "sissyPanties",
      "stage": 3,
      "path": "sissy",
      "baseCost": 500
    }
  },
  {
    "pid": 38,
    "title": "Event: First Time Getting Pegged",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-3"
    ],
    "body": "[First time] First Time Getting Pegged: A woman straps on and fucks your virgin boypussy for the first time, stretching you open while your useless cock leaks\n\n[Repeat] Get Pegged by a Woman: A woman straps on and fucks your trained boypussy again, stretching you open while your useless cock leaks pathetically",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "getPegged",
      "stage": 3,
      "path": "sissy",
      "baseCost": 1000
    }
  },
  {
    "pid": 39,
    "title": "Event: First Time Watching Her Fuck",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-3"
    ],
    "body": "[First time] First Time Watching Her Fuck: Your girlfriend makes you watch for the first time as a real man pounds her pussy, your useless cock throbbing in its cage\n\n[Repeat] Watch Her Get Fucked Again: Your girlfriend makes you watch again as a real man pounds her pussy, your caged clitty leaking pathetically",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "watchHerFucked",
      "stage": 3,
      "path": "sissy",
      "baseCost": 1200
    }
  },
  {
    "pid": 40,
    "title": "Event: First Time Fluffing",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-3"
    ],
    "body": "[First time] First Time Fluffing: Get the bull's cock hard with your mouth for the first time, nervously tasting his precum before he fucks your girlfriend\n\n[Repeat] Fluff the Bull: Get another bull's cock hard with your mouth before he fucks your girlfriend, eagerly tasting his precum",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "fluffForHer",
      "stage": 3,
      "path": "sissy",
      "baseCost": 2000
    }
  },
  {
    "pid": 41,
    "title": "Event: First Cleanup",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-3"
    ],
    "body": "[First time] First Cleanup: After the bull finishes inside her, you hesitantly lick his cum out of her pussy for the first time, swallowing every drop\n\n[Repeat] Cleanup Duty: After another bull finishes inside her, you eagerly lick his cum out of her pussy, swallowing every drop like the good cuck you are",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "cleanupDuty",
      "stage": 3,
      "path": "sissy",
      "baseCost": 3000
    }
  },
  {
    "pid": 42,
    "title": "Event: First Time Joining In",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-3"
    ],
    "body": "[First time] First Time Joining In: The bull lets you join in for the first time, using your bussy while he fucks her pussy, your mind breaking as he dominates both of you\n\n[Repeat] Join the Fucking: The bull uses your bussy again while he fucks her pussy, both of you moaning as he dominates you completely",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "joinTheFucking",
      "stage": 3,
      "path": "sissy",
      "baseCost": 5000
    }
  },
  {
    "pid": 43,
    "title": "Event: First Time Locked",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-4"
    ],
    "body": "[First time] First Time Locked: Lock your clitty in permanent chastity for the first time and serve anyone who wants you, men or women, your pleasure irrelevant\n\n[Repeat] Locked and Serving: Your clitty stays locked in permanent chastity as you serve anyone who wants you, men or women, your pleasure irrelevant",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "cageAndServe",
      "stage": 4,
      "path": "sissy",
      "baseCost": 3000
    }
  },
  {
    "pid": 44,
    "title": "Event: First Real Cock in Your Bussy",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-4"
    ],
    "body": "[First time] First Real Cock in Your Bussy: Let a man fuck your bussy for the first time, feeling a real cock stretch you open, so much better than any toy\n\n[Repeat] Get Fucked by Real Cock: Let another man pound your bussy, feeling his thick cock stretch you open as you moan like the sissy slut you are",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "firstMaleFuck",
      "stage": 4,
      "path": "sissy",
      "baseCost": 5000
    }
  },
  {
    "pid": 45,
    "title": "Event: First Breeding",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-4"
    ],
    "body": "[First time] First Breeding: Take your first breeding, load after load filling your bussy, cum flooding your guts\n\n[Repeat] Bred Like a Bitch: Take load after load in your bussy, cum flooding your guts, dripping out as more pumps in",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "sissyBreeding",
      "stage": 4,
      "path": "sissy",
      "baseCost": 8000
    }
  },
  {
    "pid": 46,
    "title": "Event: First DP",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-4"
    ],
    "body": "[First time] First DP: Experience your first double penetration, two cocks using you at once, one stretching your bussy while the other fucks your throat\n\n[Repeat] DP'd Sissy: Two cocks at once, one in your bussy and one down your throat, spit-roasted and loving every second",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "dpSissy",
      "stage": 4,
      "path": "sissy",
      "baseCost": 12000
    }
  },
  {
    "pid": 47,
    "title": "Event: First Kiss With a Man",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-1"
    ],
    "body": "[First time] First Kiss With a Man: Kiss another man for the first time, feeling his stubble and strong grip, awakening something new inside you\n\n[Repeat] Make Out With a Guy: Press your lips against another man's, tongue exploring his mouth as you give in to your desires",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "curiousKiss",
      "stage": 1,
      "path": "common",
      "baseCost": 250
    }
  },
  {
    "pid": 48,
    "title": "Event: First Kiss With a Man",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-2"
    ],
    "body": "[First time] First Kiss With a Man: Kiss another man for the first time, feeling his stubble and strong grip, awakening something new inside you\n\n[Repeat] Make Out With a Guy: Press your lips against another man's, tongue exploring his mouth as you give in to your desires",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "curiousKissStage2",
      "stage": 2,
      "path": "common",
      "baseCost": 250
    }
  },
  {
    "pid": 49,
    "title": "Event: First Time Sucking Cock",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-2"
    ],
    "body": "[First time] First Time Sucking Cock: Get on your knees and taste cock for the first time, nervously exploring it with your tongue and lips\n\n[Repeat] Suck Cock: Drop to your knees and wrap your lips around another hard cock, bobbing your head like you're learning to love",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "blowAGuyStage2",
      "stage": 2,
      "path": "common",
      "baseCost": 700
    }
  },
  {
    "pid": 50,
    "title": "Event: Rub Your New Pussy On Him",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-3"
    ],
    "body": "Grind your freshly transformed pussy against a stranger's bulge, soaking through your panties",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "lingeringTouch",
      "stage": 3,
      "path": "woman",
      "baseCost": 500
    }
  },
  {
    "pid": 51,
    "title": "Event: Show Off Your Tits",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-3"
    ],
    "body": "Flash your new breasts at men, nipples hard, watching their cocks grow",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "stolenGlance",
      "stage": 3,
      "path": "woman",
      "baseCost": 1000
    }
  },
  {
    "pid": 52,
    "title": "Event: Beg to Suck Cock",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-3"
    ],
    "body": "Drop to your knees in public, begging strangers to let you taste their dicks",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "firstKiss",
      "stage": 3,
      "path": "woman",
      "baseCost": 2000
    }
  },
  {
    "pid": 53,
    "title": "Event: Fuck Yourself On His Cock",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-4"
    ],
    "body": "Ride a stranger's dick desperately, your new pussy gripping him tight as you bounce",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "intimateEmbrace",
      "stage": 4,
      "path": "woman",
      "baseCost": 5000
    }
  },
  {
    "pid": 54,
    "title": "Event: Jerk Him With Your Tits",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-4"
    ],
    "body": "Wrap your soft breasts around his cock, sliding them up and down until he cums on your face",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "skilledHands",
      "stage": 4,
      "path": "woman",
      "baseCost": 10000
    }
  },
  {
    "pid": 55,
    "title": "Event: Deepthroat Training",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-4"
    ],
    "body": "Practice taking cock down your throat, gagging and drooling as he fucks your face",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "oralService",
      "stage": 4,
      "path": "woman",
      "baseCost": 20000
    }
  },
  {
    "pid": 56,
    "title": "Event: Masturbate In Public",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-4"
    ],
    "body": "Finger your dripping pussy on the subway, moaning as strangers watch and jerk off",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "publicAttention",
      "stage": 4,
      "path": "woman",
      "baseCost": 15000
    }
  },
  {
    "pid": 57,
    "title": "Event: Beg Strangers to Breed You",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-5"
    ],
    "body": "Walk up to random men and beg them to fuck your needy pussy raw and cum inside",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "penetration",
      "stage": 5,
      "path": "woman",
      "baseCost": 50000
    }
  },
  {
    "pid": 58,
    "title": "Event: Ovulation Slut",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-5"
    ],
    "body": "Hunt for cock when you're most fertile, begging men to knock you up as you cum on their dicks",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "bred",
      "stage": 5,
      "path": "woman",
      "baseCost": 150000
    }
  },
  {
    "pid": 59,
    "title": "Event: Street Corner Breeding",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-5"
    ],
    "body": "Bend over on the street corner, letting any man who walks by fuck and breed you",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "publicUse",
      "stage": 5,
      "path": "woman",
      "baseCost": 200000
    }
  },
  {
    "pid": 60,
    "title": "Event: Anal Training",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-5"
    ],
    "body": "Practice taking bigger and bigger cocks in your ass, learning to love the stretch and burn",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "analTraining",
      "stage": 5,
      "path": "woman",
      "baseCost": 180000
    }
  },
  {
    "pid": 61,
    "title": "Event: Double Penetration Slut",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-5"
    ],
    "body": "Take two cocks at once, one in your pussy and one in your ass, feeling completely filled and used",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "dpSlut",
      "stage": 5,
      "path": "woman",
      "baseCost": 200000
    }
  },
  {
    "pid": 62,
    "title": "Event: Airtight Whore",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-5"
    ],
    "body": "Get fucked in all three holes at once, choking on cock while your pussy and ass are stretched and filled",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "gangService",
      "stage": 5,
      "path": "woman",
      "baseCost": 230000
    }
  },
  {
    "pid": 63,
    "title": "Event: Bathroom Gangbang",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-5"
    ],
    "body": "Let a line of men run a train on you in a public bathroom, each one dumping their load in your holes",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "multiplePartners",
      "stage": 5,
      "path": "woman",
      "baseCost": 270000
    }
  },
  {
    "pid": 64,
    "title": "Event: 24/7 Breeding Bitch",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-6"
    ],
    "body": "Write 'FREE USE CUMDUMP' on your body, letting strangers use all your holes anytime, anywhere",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "breedingGround",
      "stage": 6,
      "path": "woman",
      "baseCost": 500000
    }
  },
  {
    "pid": 65,
    "title": "Event: Bukkake Queen",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-6"
    ],
    "body": "Kneel in the center of dozens of men, jerking and sucking them all as they cover you in thick ropes of cum",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "semenBath",
      "stage": 6,
      "path": "woman",
      "baseCost": 750000
    }
  },
  {
    "pid": 66,
    "title": "Event: Anal Gangbang Whore",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-6"
    ],
    "body": "A line of men takes turns destroying your ass, each one going deeper and harder than the last",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "analGangbang",
      "stage": 6,
      "path": "woman",
      "baseCost": 800000
    }
  },
  {
    "pid": 67,
    "title": "Event: Triple Stuffed",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-6"
    ],
    "body": "Experience the ultimate degradation: all three holes filled at once, used as nothing but a set of cum receptacles",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "triplePenetration",
      "stage": 6,
      "path": "woman",
      "baseCost": 900000
    }
  },
  {
    "pid": 68,
    "title": "Event: Endless Breeding Marathon",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-6"
    ],
    "body": "Spend 24 hours straight getting fucked, all three holes never empty, cum leaking from every orifice",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "endlessService",
      "stage": 6,
      "path": "woman",
      "baseCost": 100000
    }
  },
  {
    "pid": 69,
    "title": "Event: Human Cum Toilet",
    "tags": [
      "semen-event",
      "woman-path",
      "stage-6"
    ],
    "body": "Declare yourself public property, existing only as three holes for men to dump their loads in",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "cumDump",
      "stage": 6,
      "path": "woman",
      "baseCost": 150000
    }
  },
  {
    "pid": 70,
    "title": "Event: Train Your Bussy",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-3"
    ],
    "body": "Ride dildos for hours, training your boycunt to take bigger and bigger cocks like a good sissy",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "bussyTraining",
      "stage": 3,
      "path": "sissy",
      "baseCost": 1500
    }
  },
  {
    "pid": 71,
    "title": "Event: Practice Sissy Makeup",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-3"
    ],
    "body": "Spend hours perfecting your slutty look, heavy mascara and glossy lips, looking like the whore you're becoming",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "sissyMakeup",
      "stage": 3,
      "path": "sissy",
      "baseCost": 800
    }
  },
  {
    "pid": 72,
    "title": "Event: Sissy Gangbang",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-5"
    ],
    "body": "Service another group of men, eagerly passed around like the fucktoy you've become, every hole used by both men and women with strap-ons",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "sissyGangbang",
      "stage": 5,
      "path": "sissy",
      "baseCost": 450000
    }
  },
  {
    "pid": 73,
    "title": "Event: Collared Sissy",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-5"
    ],
    "body": "Wear a collar that says SISSY SLUT everywhere you go, proudly displaying what you are to everyone",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "wearSlutCollar",
      "stage": 5,
      "path": "sissy",
      "baseCost": 200000
    }
  },
  {
    "pid": 74,
    "title": "Event: Glory Hole Slut",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-5"
    ],
    "body": "Spend hours at a glory hole, bent over taking anonymous cocks in your gaped bussy, men and women using you",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "gloryholeBussy",
      "stage": 5,
      "path": "sissy",
      "baseCost": 300000
    }
  },
  {
    "pid": 75,
    "title": "Event: Sissy Slut Orgy",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-5"
    ],
    "body": "Join other sissies in servicing a room full of people, competing to see who can be the best cumdump",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "sissyOrgy",
      "stage": 5,
      "path": "sissy",
      "baseCost": 600000
    }
  },
  {
    "pid": 76,
    "title": "Event: Cuck at Gangbang",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-5"
    ],
    "body": "Watch helplessly as multiple men run a train on your girl, your caged clitty leaking as they breed her",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "watchGangbang",
      "stage": 5,
      "path": "sissy",
      "baseCost": 35000
    }
  },
  {
    "pid": 77,
    "title": "Event: Double Cucked",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-5"
    ],
    "body": "Both you and your girlfriend get fucked by real men side by side, both of you moaning like whores",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "doubleCuck",
      "stage": 5,
      "path": "sissy",
      "baseCost": 60000
    }
  },
  {
    "pid": 78,
    "title": "Event: Public Sissy Toilet",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-6"
    ],
    "body": "Sit in a public restroom with a FREE USE sign, taking every person who walks in, man or woman",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "publicCumToilet",
      "stage": 6,
      "path": "sissy",
      "baseCost": 100000
    }
  },
  {
    "pid": 79,
    "title": "Event: Bathtub of Cum",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-6"
    ],
    "body": "Lie in a tub while dozens of men jerk off on you, coating you completely in their seed",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "sissyCumBath",
      "stage": 6,
      "path": "sissy",
      "baseCost": 150000
    }
  },
  {
    "pid": 80,
    "title": "Event: Forever Sissy",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-6"
    ],
    "body": "This is your truth now. Not a man. Not a woman. Just a sissy cumdump existing to serve anyone who wants to use you",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "permanentSissySlut",
      "stage": 6,
      "path": "sissy",
      "baseCost": 250000
    }
  },
  {
    "pid": 81,
    "title": "Event: Permanent Cuckold",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-6"
    ],
    "body": "She locks you in chastity permanently and openly fucks other men, making you watch and clean up every time",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "permanentCuck",
      "stage": 6,
      "path": "sissy",
      "baseCost": 180000
    }
  },
  {
    "pid": 82,
    "title": "Event: Cuck Wedding Night",
    "tags": [
      "semen-event",
      "sissy-path",
      "stage-6"
    ],
    "body": "On your wedding night, you watch as the best man breeds your new wife while you're locked in your cage, crying and leaking",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "sissyWedding",
      "stage": 6,
      "path": "sissy",
      "baseCost": 300000
    }
  },
  {
    "pid": 83,
    "title": "Event: Flirt at Bar",
    "tags": [
      "semen-event",
      "common",
      "stage-0"
    ],
    "body": "Chat up an attractive woman at the bar, feeling confident and dominant",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "flirtAtBar",
      "stage": 0,
      "path": "common",
      "baseCost": 25
    }
  },
  {
    "pid": 84,
    "title": "Event: Buy Her a Drink",
    "tags": [
      "semen-event",
      "common",
      "stage-0"
    ],
    "body": "Impress her with your generosity, watching her smile submissively",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "buyDrink",
      "stage": 0,
      "path": "common",
      "baseCost": 50
    }
  },
  {
    "pid": 85,
    "title": "Event: Grope Her on Dance Floor",
    "tags": [
      "semen-event",
      "common",
      "stage-0"
    ],
    "body": "Pull her close, groping her ass while your hard cock presses against her",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "danceClose",
      "stage": 0,
      "path": "common",
      "baseCost": 100
    }
  },
  {
    "pid": 86,
    "title": "Event: Finger Her Pussy",
    "tags": [
      "semen-event",
      "common",
      "stage-0"
    ],
    "body": "Push your fingers inside her wet pussy, dominating her with your touch",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "fingerHer",
      "stage": 0,
      "path": "common",
      "baseCost": 150
    }
  },
  {
    "pid": 87,
    "title": "Event: Face Fuck Her",
    "tags": [
      "semen-event",
      "common",
      "stage-0"
    ],
    "body": "Grab her hair and thrust into her throat, using her mouth aggressively",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "getDomBlow",
      "stage": 0,
      "path": "common",
      "baseCost": 200
    }
  },
  {
    "pid": 88,
    "title": "Event: Rough Fuck",
    "tags": [
      "semen-event",
      "common",
      "stage-0"
    ],
    "body": "Bend her over and pound her pussy hard, making her scream",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "roughFuck",
      "stage": 0,
      "path": "common",
      "baseCost": 300
    }
  },
  {
    "pid": 89,
    "title": "Event: Threesome with Two Girls",
    "tags": [
      "semen-event",
      "common",
      "stage-0"
    ],
    "body": "Two women worship your cock, taking turns riding you and sucking you",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "threesomeFFF",
      "stage": 0,
      "path": "common",
      "baseCost": 500
    }
  },
  {
    "pid": 90,
    "title": "Event: DP Two Girls",
    "tags": [
      "semen-event",
      "common",
      "stage-0"
    ],
    "body": "Fuck one girl's pussy while another sits on your face, both moaning",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "doublePenetration",
      "stage": 0,
      "path": "common",
      "baseCost": 750
    }
  },
  {
    "pid": 91,
    "title": "Event: Dominate an Orgy",
    "tags": [
      "semen-event",
      "common",
      "stage-0"
    ],
    "body": "Multiple women line up to take your cock, you breed them one by one",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "orgyDom",
      "stage": 0,
      "path": "common",
      "baseCost": 1000
    }
  },
  {
    "pid": 92,
    "title": "Event: Apologize With Drinks",
    "tags": [
      "semen-event",
      "common",
      "stage-1"
    ],
    "body": "Buy her drinks hoping she won't notice your cock is smaller now",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "buyDrinkStage1",
      "stage": 1,
      "path": "common",
      "baseCost": 250
    }
  },
  {
    "pid": 93,
    "title": "Event: Grind Nervously",
    "tags": [
      "semen-event",
      "common",
      "stage-1"
    ],
    "body": "Press against her, worried she'll feel how much smaller your bulge is",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "danceCloseStage1",
      "stage": 1,
      "path": "common",
      "baseCost": 400
    }
  },
  {
    "pid": 94,
    "title": "Event: She Laughs at Your Size",
    "tags": [
      "semen-event",
      "common",
      "stage-1"
    ],
    "body": "Pull it out and watch her giggle at how much you've shrunk",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "getDomBlowStage1",
      "stage": 1,
      "path": "common",
      "baseCost": 500
    }
  },
  {
    "pid": 95,
    "title": "Event: Focus on Her Pleasure",
    "tags": [
      "semen-event",
      "common",
      "stage-1"
    ],
    "body": "Finger her desperately, knowing your cock isn't enough anymore",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "fingerHerStage1",
      "stage": 1,
      "path": "common",
      "baseCost": 600
    }
  },
  {
    "pid": 96,
    "title": "Event: Gentle Blowjob",
    "tags": [
      "semen-event",
      "common",
      "stage-1"
    ],
    "body": "She takes it in her mouth but it's too small for a real deepthroat, just gentle sucking on your sensitive tip",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "gentleBlow",
      "stage": 1,
      "path": "common",
      "baseCost": 550
    }
  },
  {
    "pid": 97,
    "title": "Event: Try to Satisfy Her",
    "tags": [
      "semen-event",
      "common",
      "stage-1"
    ],
    "body": "Fuck her with your shrinking cock, hearing her fake her moans",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "roughFuckStage1",
      "stage": 1,
      "path": "common",
      "baseCost": 800
    }
  },
  {
    "pid": 98,
    "title": "Event: Cum Too Quick",
    "tags": [
      "semen-event",
      "common",
      "stage-1"
    ],
    "body": "She barely touches you before you explode, your cock too sensitive now to last more than seconds",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "cantLastLong",
      "stage": 1,
      "path": "common",
      "baseCost": 950
    }
  },
  {
    "pid": 99,
    "title": "Event: Touch His Cock",
    "tags": [
      "semen-event",
      "common",
      "stage-1"
    ],
    "body": "Nervously stroke another man's hard cock, curious about the feeling",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "touchHisCock",
      "stage": 1,
      "path": "common",
      "baseCost": 400
    }
  },
  {
    "pid": 100,
    "title": "Event: Mutual Masturbation",
    "tags": [
      "semen-event",
      "common",
      "stage-1"
    ],
    "body": "Jerk each other off, comparing sizes and techniques",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "mutualJerk",
      "stage": 1,
      "path": "common",
      "baseCost": 450
    }
  },
  {
    "pid": 101,
    "title": "Event: Watch Her With Another Man",
    "tags": [
      "semen-event",
      "common",
      "stage-2"
    ],
    "body": "She invites a real man over, you watch from the corner stroking your tiny cock",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "threesomeFFFStage2",
      "stage": 2,
      "path": "common",
      "baseCost": 1000
    }
  },
  {
    "pid": 102,
    "title": "Event: She Compares You",
    "tags": [
      "semen-event",
      "common",
      "stage-2"
    ],
    "body": "She makes you stand next to her date, comparing your shrinking cock to his, laughing at the difference",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "doublePenetrationStage2",
      "stage": 2,
      "path": "common",
      "baseCost": 1500
    }
  },
  {
    "pid": 103,
    "title": "Event: Eat Her Out After",
    "tags": [
      "semen-event",
      "common",
      "stage-2"
    ],
    "body": "After he finishes, she pushes your face between her legs to clean her with your tongue while he watches",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "orgyDomStage2",
      "stage": 2,
      "path": "common",
      "baseCost": 2500
    }
  },
  {
    "pid": 104,
    "title": "Event: Watch From the Closet",
    "tags": [
      "semen-event",
      "common",
      "stage-2"
    ],
    "body": "She brings a man home and makes you hide in the closet, watching through the crack as he satisfies her",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "cuckoldGangbang",
      "stage": 2,
      "path": "common",
      "baseCost": 4000
    }
  },
  {
    "pid": 105,
    "title": "Event: Touch His Cock",
    "tags": [
      "semen-event",
      "common",
      "stage-2"
    ],
    "body": "Nervously stroke another man's hard cock, curious about the feeling",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "touchHisCockStage2",
      "stage": 2,
      "path": "common",
      "baseCost": 400
    }
  },
  {
    "pid": 106,
    "title": "Event: Mutual Masturbation",
    "tags": [
      "semen-event",
      "common",
      "stage-2"
    ],
    "body": "Jerk each other off, comparing sizes and techniques",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "mutualJerkStage2",
      "stage": 2,
      "path": "common",
      "baseCost": 450
    }
  },
  {
    "pid": 107,
    "title": "Event: Cock Rubbing",
    "tags": [
      "semen-event",
      "common",
      "stage-2"
    ],
    "body": "Press your cocks together and rub them, both slick with precum and throbbing",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "frotting",
      "stage": 2,
      "path": "common",
      "baseCost": 550
    }
  },
  {
    "pid": 108,
    "title": "Event: Guy Sucks You",
    "tags": [
      "semen-event",
      "common",
      "stage-2"
    ],
    "body": "Let a man worship your cock with his mouth, his technique different from women",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "getBlownByGuyStage2",
      "stage": 2,
      "path": "common",
      "baseCost": 850
    }
  },
  {
    "pid": 109,
    "title": "Event: 69 with a Guy",
    "tags": [
      "semen-event",
      "common",
      "stage-2"
    ],
    "body": "Both sucking each other's cocks simultaneously, exploring this new pleasure",
    "links": [],
    "meta": {
      "category": "semen-event",
      "key": "sixtynineGuyStage2",
      "stage": 2,
      "path": "common",
      "baseCost": 1200
    }
  },
  {
    "pid": 110,
    "title": "Achievement: First Steps",
    "tags": [
      "achievement",
      "ach-progression"
    ],
    "body": " Click the button for the first time",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "firstClick",
      "achievementCategory": "progression",
      "icon": ""
    }
  },
  {
    "pid": 111,
    "title": "Achievement: Essence Hoarder",
    "tags": [
      "achievement",
      "ach-progression"
    ],
    "body": " Reach 1,000 total essence",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "hoarder",
      "achievementCategory": "progression",
      "icon": ""
    }
  },
  {
    "pid": 112,
    "title": "Achievement: Powerhouse",
    "tags": [
      "achievement",
      "ach-progression"
    ],
    "body": " Reach 1,000,000 total essence",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "powerhouse",
      "achievementCategory": "progression",
      "icon": ""
    }
  },
  {
    "pid": 113,
    "title": "Achievement: Transcendent",
    "tags": [
      "achievement",
      "ach-progression"
    ],
    "body": " Reach 1 billion total essence",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "transcendent",
      "achievementCategory": "progression",
      "icon": ""
    }
  },
  {
    "pid": 114,
    "title": "Achievement: Godlike Power",
    "tags": [
      "achievement",
      "ach-progression"
    ],
    "body": " Reach 1 trillion total essence",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "godlike",
      "achievementCategory": "progression",
      "icon": ""
    }
  },
  {
    "pid": 115,
    "title": "Achievement: The Awakening",
    "tags": [
      "achievement",
      "ach-stages"
    ],
    "body": " Reach Stage 1: Curiosity",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "awakening",
      "achievementCategory": "stages",
      "icon": ""
    }
  },
  {
    "pid": 116,
    "title": "Achievement: Acceptance",
    "tags": [
      "achievement",
      "ach-stages"
    ],
    "body": " Reach Stage 2: Experimentation",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "acceptance",
      "achievementCategory": "stages",
      "icon": ""
    }
  },
  {
    "pid": 117,
    "title": "Achievement: True Self",
    "tags": [
      "achievement",
      "ach-stages"
    ],
    "body": " Complete your first transformation (Stage 3)",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "transformation",
      "achievementCategory": "stages",
      "icon": ""
    }
  },
  {
    "pid": 118,
    "title": "Achievement: Apotheosis",
    "tags": [
      "achievement",
      "ach-stages"
    ],
    "body": " Reach Stage 4",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "apotheosis",
      "achievementCategory": "stages",
      "icon": ""
    }
  },
  {
    "pid": 119,
    "title": "Achievement: Cosmic Being",
    "tags": [
      "achievement",
      "ach-stages"
    ],
    "body": " Reach Stage 5",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "cosmic",
      "achievementCategory": "stages",
      "icon": ""
    }
  },
  {
    "pid": 120,
    "title": "Achievement: Ultimate Form",
    "tags": [
      "achievement",
      "ach-stages"
    ],
    "body": " Reach the final stage (Stage 6)",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "ultimate",
      "achievementCategory": "stages",
      "icon": ""
    }
  },
  {
    "pid": 121,
    "title": "Achievement: Fertility Goddess",
    "tags": [
      "achievement",
      "ach-paths"
    ],
    "body": " Ascend to become a Fertility Goddess",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "fertilityGoddess",
      "achievementCategory": "paths",
      "icon": ""
    }
  },
  {
    "pid": 122,
    "title": "Achievement: Sissy Journey",
    "tags": [
      "achievement",
      "ach-paths"
    ],
    "body": " Choose the Sissy path",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "sissyPath",
      "achievementCategory": "paths",
      "icon": ""
    }
  },
  {
    "pid": 123,
    "title": "Achievement: Eager Clicker",
    "tags": [
      "achievement",
      "ach-clicking"
    ],
    "body": " Manually click 100 times",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "clicker",
      "achievementCategory": "clicking",
      "icon": ""
    }
  },
  {
    "pid": 124,
    "title": "Achievement: Click Addict",
    "tags": [
      "achievement",
      "ach-clicking"
    ],
    "body": " Manually click 1,000 times",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "superClicker",
      "achievementCategory": "clicking",
      "icon": ""
    }
  },
  {
    "pid": 125,
    "title": "Achievement: Click Master",
    "tags": [
      "achievement",
      "ach-clicking"
    ],
    "body": " Manually click 10,000 times",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "ultraClicker",
      "achievementCategory": "clicking",
      "icon": ""
    }
  },
  {
    "pid": 126,
    "title": "Achievement: Automation Begins",
    "tags": [
      "achievement",
      "ach-modifiers"
    ],
    "body": " Purchase your first modifier",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "automation",
      "achievementCategory": "modifiers",
      "icon": ""
    }
  },
  {
    "pid": 127,
    "title": "Achievement: Collector",
    "tags": [
      "achievement",
      "ach-modifiers"
    ],
    "body": " Own 100 total modifiers",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "collector",
      "achievementCategory": "modifiers",
      "icon": ""
    }
  },
  {
    "pid": 128,
    "title": "Achievement: Modifier Empire",
    "tags": [
      "achievement",
      "ach-modifiers"
    ],
    "body": " Own 500 total modifiers",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "empire",
      "achievementCategory": "modifiers",
      "icon": ""
    }
  },
  {
    "pid": 129,
    "title": "Achievement: Industrial Complex",
    "tags": [
      "achievement",
      "ach-modifiers"
    ],
    "body": " Own 1,000 total modifiers",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "industrial",
      "achievementCategory": "modifiers",
      "icon": ""
    }
  },
  {
    "pid": 130,
    "title": "Achievement: Enhanced",
    "tags": [
      "achievement",
      "ach-upgrades"
    ],
    "body": " Purchase your first upgrade",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "enhanced",
      "achievementCategory": "upgrades",
      "icon": ""
    }
  },
  {
    "pid": 131,
    "title": "Achievement: Power Overwhelming",
    "tags": [
      "achievement",
      "ach-upgrades"
    ],
    "body": " Purchase 25 total upgrade levels",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "powerfulUpgrades",
      "achievementCategory": "upgrades",
      "icon": ""
    }
  },
  {
    "pid": 132,
    "title": "Achievement: First Drop",
    "tags": [
      "achievement",
      "ach-semen"
    ],
    "body": " Collect 100 ml of cum",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "firstDrop",
      "achievementCategory": "semen",
      "icon": ""
    }
  },
  {
    "pid": 133,
    "title": "Achievement: Cum Hoarder",
    "tags": [
      "achievement",
      "ach-semen"
    ],
    "body": " Collect 10,000 ml of cum total",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "cumHoarder",
      "achievementCategory": "semen",
      "icon": ""
    }
  },
  {
    "pid": 134,
    "title": "Achievement: Cum Addict",
    "tags": [
      "achievement",
      "ach-semen"
    ],
    "body": " Collect 100,000 ml of cum total",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "cumAddict",
      "achievementCategory": "semen",
      "icon": ""
    }
  },
  {
    "pid": 135,
    "title": "Achievement: First Experience",
    "tags": [
      "achievement",
      "ach-events"
    ],
    "body": " Complete your first event",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "eventUnlocked",
      "achievementCategory": "events",
      "icon": ""
    }
  },
  {
    "pid": 136,
    "title": "Achievement: Experienced",
    "tags": [
      "achievement",
      "ach-events"
    ],
    "body": " Complete 10 different events",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "experienced",
      "achievementCategory": "events",
      "icon": ""
    }
  },
  {
    "pid": 137,
    "title": "Achievement: Complete Slut",
    "tags": [
      "achievement",
      "ach-events"
    ],
    "body": " Complete 25 different events",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "slut",
      "achievementCategory": "events",
      "icon": ""
    }
  },
  {
    "pid": 138,
    "title": "Achievement: Lost Innocence",
    "tags": [
      "achievement",
      "ach-special"
    ],
    "body": " Lose your virginity (any type)",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "noLongerInnocent",
      "achievementCategory": "special",
      "icon": ""
    }
  },
  {
    "pid": 139,
    "title": "Achievement: Fully Experienced",
    "tags": [
      "achievement",
      "ach-special"
    ],
    "body": " Lose both types of virginity",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "fullyExperienced",
      "achievementCategory": "special",
      "icon": ""
    }
  },
  {
    "pid": 140,
    "title": "Achievement: Multitasker",
    "tags": [
      "achievement",
      "ach-special"
    ],
    "body": " Own at least 1 of every type of modifier",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "multitasker",
      "achievementCategory": "special",
      "icon": ""
    }
  },
  {
    "pid": 141,
    "title": "Achievement: Patient One",
    "tags": [
      "achievement",
      "ach-special"
    ],
    "body": " Play for 1 hour total",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "patient",
      "achievementCategory": "special",
      "icon": ""
    }
  },
  {
    "pid": 142,
    "title": "Achievement: Dedicated",
    "tags": [
      "achievement",
      "ach-special"
    ],
    "body": " Play for 5 hours total",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "dedicated",
      "achievementCategory": "special",
      "icon": ""
    }
  },
  {
    "pid": 143,
    "title": "Achievement: Perfectionist",
    "tags": [
      "achievement",
      "ach-special"
    ],
    "body": " Unlock all other achievements",
    "links": [],
    "meta": {
      "category": "achievement",
      "key": "perfectionist",
      "achievementCategory": "special",
      "icon": ""
    }
  },
  {
    "pid": 144,
    "title": "News: Normal (Male)",
    "tags": [
      "news-ticker",
      "common"
    ],
    "body": "News ticker templates for Normal (Male):\n\n1. {name} seals multi-million dollar merger, celebrates by bending secretary over his desk at {location}\n2. Gym {name} deadlifts 500lbs, leaves with phone numbers from {men} different women at {location}\n3. High roller {name} wins big at poker table, takes home the dealer for rough victory fuck at {location}\n4. Bar brawler {name} knocks out {men} guys in fight, everyone buys him drinks at {location}\n5. {name} picks up blonde and brunette twins, fucks both simultaneously at {location}\n6. {name} rails girlfriend relentlessly for {time} minutes, leaves her trembling and dripping at {location}\n7. One-night stand gets creampied in backseat, {name} speeds off leaving her leaking at {location}\n8. VP promotion secured, {name} fucks his assistant raw to celebrate at {location}\n9. Revenge sex in bathroom stall, {name} pounds ex's best friend during house party at {location}\n10. Well-hung {name}'s 7-inch cock makes girl squirt {orgasms} times in one session at {location}\n11. {name} drinks {men} whiskeys, still dominates girlfriend in bed all night long at {location}\n12. Rough sex session lasts {time} minutes, {name} leaves bite marks and handprints everywhere at {location}\n13. {name} fucks {men} different women in same weekend at {location}\n14. {name} fingerbangs date under table during dinner, makes her cum quietly at {location}\n15. Dominant {name} ties up hookup, fucks her until she begs him to stop at {location}",
    "links": [],
    "meta": {
      "category": "news-ticker",
      "newsStage": 0,
      "templateCount": 15
    }
  },
  {
    "pid": 145,
    "title": "News: Awakening",
    "tags": [
      "news-ticker",
      "common"
    ],
    "body": "News ticker templates for Awakening:\n\n1. {name} measures dick at only 4 inches, realizes he's inadequate compared to other men at {location}\n2. {name} lasts only {time} seconds during sex, girlfriend sighs disappointed at {location}\n3. Woman takes charge, pins {name} down and rides his face for {time} minutes at {location}\n4. Curious {name} rubs cocks with stranger from app, both get hard together at {location}\n5. Woman fakes moans during sex, {name} doesn't even notice she's not enjoying it at {location}\n6. Straight {name} gives his first handjob to stranger in car at {location}\n7. {name} experiments with {men} different guys on dating apps, curious about male attention at {location}\n8. Girl refuses to give blowjob to {name}, says his dick is too small to bother at {location}\n9. {name} gets caught staring at bulges in stranger's pants, runs out embarrassed at {location}\n10. {name} tries to deepthroat woman, but it barely touches her throat at {location}\n11. {name} cums before the second thrust, woman rolls her eyes at {location}\n12. Small-dicked {name} learns to please girlfriend with tongue instead of cock at {location}\n13. Two curious {name}s frot together in bathroom stall, both finish at {location}\n14. Woman laughs comparing {name}'s 4-inch dick to her ex's {dicksize} inches at {location}\n15. {name} discovers he gets harder when women reject him for small size at {location}\n16. Makeout session with {name} from bar gets heated and handsy at {location}",
    "links": [],
    "meta": {
      "category": "news-ticker",
      "newsStage": 1,
      "templateCount": 16
    }
  },
  {
    "pid": 146,
    "title": "News: Metamorphosis",
    "tags": [
      "news-ticker",
      "common"
    ],
    "body": "News ticker templates for Metamorphosis:\n\n1. Girlfriend brings home guy with {dicksize}-inch cock, makes {name} watch from corner at {location}\n2. {name} nervously sucks off {dicksize}-inch cock for {time} minutes at {location}\n3. Stranger goes down on 4.5-inch {name}, receiving a blowjob from the man at {location}\n4. {name} watches wife get pounded for {time} minutes, not allowed to touch at {location}\n5. Two experimenting {name}s try 69 position, both cum in each other's mouths at {location}\n6. {name} discovers arousal watching girlfriend kiss another man at party at {location}\n7. {name} deepthroats {dicksize}-inch cock for first time, gags but keeps going at {location}\n8. {name} watches wife take bigger cock and moan louder than ever at {location}\n9. Curious {name} gets his dick sucked by stranger, can't believe how good it feels at {location}\n10. Wife gets bred by bull while {name} watches helplessly, leaking in his pants at {location}\n11. 69 session lasts {time} minutes, both {name}s swallow each other's loads at {location}\n12. {name} witnesses girlfriend orgasm {orgasms} times on bull's cock in one session at {location}\n13. {name} sucks off {men} different guys from apps in one week at {location}\n14. Girlfriend explains bull's cock is bigger and better while cuckolding {name} at {location}\n15. {name} practices deepthroating techniques on Grindr hookup at {location}",
    "links": [],
    "meta": {
      "category": "news-ticker",
      "newsStage": 2,
      "templateCount": 15
    }
  },
  {
    "pid": 147,
    "title": "News: Fertile Vessel (Woman)",
    "tags": [
      "news-ticker",
      "woman-path"
    ],
    "body": "News ticker templates for Fertile Vessel (Woman):\n\n1. {name} rides {dicksize}-inch cock, cums continuously for {time} minutes at {location}\n2. {name} rubs new pussy against stranger's bulge, soaking through panties at {location}\n3. Desperate {name} begs {men} strangers to pound her needy pussy in one night at {location}\n4. Empty womb clenches and aches constantly, {name} needs cock to feel complete at {location}\n5. {name} flashes breasts at men, nipples hard and desperate for attention at {location}\n6. Tight pussy stretched wide by {dicksize}-inch dick, {name} screaming through rolling orgasms at {location}\n7. {name} drops to knees begging for cock in public at {location}\n8. Fresh creampie pumped deep into womb, {name} immediately begs for another load at {location}\n9. Man buries face between {name}'s legs, eating pussy for {time} minutes at {location}\n10. Insatiable pussy takes {loads} creampies back-to-back in marathon session for {name} at {location}\n11. {name} takes cock deep, orgasms {orgasms} times in one session, screams in pleasure at {location}\n12. Transformation complete, {name} is addicted to seed at {location}\n13. Wet hole clenches rhythmically on cock, {name} milking every drop at {location}\n14. {name} is obsessed with swallowing cum, can't get enough at {location}\n15. Pussy floods with wetness at mere sight of bulge, {name} desperate at {location}",
    "links": [],
    "meta": {
      "category": "news-ticker",
      "newsStage": 3,
      "templateCount": 15
    }
  },
  {
    "pid": 148,
    "title": "News: Breeding Doll (Woman)",
    "tags": [
      "news-ticker",
      "woman-path"
    ],
    "body": "News ticker templates for Breeding Doll (Woman):\n\n1. Massive tits bouncing hypnotically as {name} rides {men} cocks in rotation at {location}\n2. {name} rides stranger's {dicksize}-inch cock desperately, new pussy gripping him tight as she bounces at {location}\n3. Curvy {name}'s greedy pussy swallows {loads} loads, body still begging for more at {location}\n4. {name} wraps soft breasts around his cock, sliding them up and down until he cums on her face at {location}\n5. Vice-grip pussy milks cock completely dry in under {time} minutes, {name} draining him at {location}\n6. Huge-titted {name} swallows {loads} thick loads for breakfast nutrition at {location}\n7. {name} takes {dicksize}-inch cock down her throat, gagging and drooling as he fucks her face for {time} minutes at {location}\n8. Perfect hourglass {name} collects {loads} creampies during all-night fuckfest at {location}\n9. {name} fingers dripping pussy at {location}, moaning as strangers watch and jerk off \n10. Flexible {name} takes fist in pussy while {dicksize}-inch cock pounds her simultaneously at {location}\n11. Curvy {name} gets pounded for {time} minutes by {dicksize}-inch cock at {location}\n12. {name} practices deepthroat training daily, throat fucked for {time} minutes straight at {location}\n13. 38DD {name} tits lactate while getting gangbanged by {men} men at {location}\n14. {name} jerks him with her tits in public, cum exploding across her bouncing breasts at {location}\n15. {name} services bachelor party, every guy fills her {loads} times at {location}\n16. Cum-drunk {name} gulps down {loads} loads, treats semen like essential food at {location}",
    "links": [],
    "meta": {
      "category": "news-ticker",
      "newsStage": 4,
      "templateCount": 16
    }
  },
  {
    "pid": 149,
    "title": "News: Brood Mother (Woman)",
    "tags": [
      "news-ticker",
      "woman-path"
    ],
    "body": "News ticker templates for Brood Mother (Woman):\n\n1. {name} takes cock in all three holes at once, body made for this at {location}\n2. {name}'s pussy, ass, and throat overflow with seed simultaneously at {location}\n3. {name} walks up to random men begging them to fuck her needy pussy raw and cum inside at {location}\n4. {name}'s ass stretched by {dicksize}-inch cock while fist pumps in soaking pussy at {location}\n5. {name} bends over letting another cock pound her ass, learning to love tight hole at {location}\n6. {name} hunts for cock when most fertile, begging men to breed her so she can cum on their dicks at {location}\n7. Triple penetration session leaves {name}'s all holes dripping with gallons of cum at {location}\n8. {name} bends over on street corner, letting any man who walks by fuck and breed her at {location}\n9. {name} takes two cocks at once, one in pussy and one in ass, feeling completely filled and used at {location}\n10. {name} takes {loads} loads distributed across all holes at {location}\n11. All-holes marathon fuck session lasts {time} minutes without stopping for {name} at {location}\n12. {name} orgasms {orgasms} times from having all holes filled at {location}\n13. {name} practices taking bigger and bigger cocks in ass, learning to love the stretch and burn at {location}\n14. {name} gets fucked in all three holes at once, choking on cock while pussy and ass are stretched and filled at {location}\n15. Let a line of {men} men run a train on {name} in public bathroom, each one dumping their load in her holes at {location}",
    "links": [],
    "meta": {
      "category": "news-ticker",
      "newsStage": 5,
      "templateCount": 15
    }
  },
  {
    "pid": 150,
    "title": "News: Goddess (Woman)",
    "tags": [
      "news-ticker",
      "woman-path"
    ],
    "body": "News ticker templates for Goddess (Woman):\n\n1. {name} walks through {location}, {men} men spontaneously orgasm from her aura alone\n2. {name} inscribes sacred markings on divine flesh, mortals worship freely at {location}\n3. Sacred pussy of {name} pulses with energy, triggers mass breeding frenzy across entire {location}\n4. {name} kneels in circle of {men} worshippers, blessed by their tribute raining down at {location}\n5. {name} bends reality itself around {location} during breeding ritual\n6. Holy ass of {name} receives pilgrims in sacred procession, each devotee penetrates deeper in worship at {location}\n7. Temple erected at {location} as cum shrine, endless offerings made to {name}\n8. Reality fractures as {name} takes infinite cocks, men cum perpetually in her presence at {location}\n9. Trinity of {name}'s holes receives simultaneous worship, experiencing ultimate devotion at {location}\n10. {name} drains {men} worshippers at once, their seed fueling divinity at {location}\n11. Men pilgrimage across world to deposit seed in {name}'s eternal womb at {location}\n12. {name} causes spontaneous impregnation just by existing near mortals at {location}\n13. {name} transcends mortal breeding, creates life from pure sexual energy at {location}\n14. Reality rewrites itself around {name}'s pussy, all men become eternal worshippers at {location}",
    "links": [],
    "meta": {
      "category": "news-ticker",
      "newsStage": 6,
      "templateCount": 14
    }
  },
  {
    "pid": 151,
    "title": "News: Sissy Awakening",
    "tags": [
      "news-ticker",
      "sissy-path"
    ],
    "body": "News ticker templates for Sissy Awakening:\n\n1. Sissy learns to apply foundation and eyeliner, practices for {time} minutes daily at {location}\n2. First time riding {dicksize}-inch dildo, sissy trains boycunt for real cock at {location}\n3. Wife teaches sissy proper makeup techniques before bringing bull home at {location}\n4. Sissy practices deepthroating dildo in bathroom, preparing to fluff bull at {location}\n5. Cuckold couple invites sissy to watch, sissy applies slutty makeup beforehand at {location}\n6. Sissy starts with pink lipstick, graduates to full face of makeup daily at {location}\n7. Training session with {dicksize}-inch dildo lasts {time} minutes, boycunt stretching at {location}\n8. Wife allows sissy to fluff her bull, sissy gets him hard before breeding at {location}\n9. Sissy cleans up creampie with tongue after couple finishes at {location}\n10. First inclusion: sissy holds wife's hand while bull breeds her at {location}\n11. Mascara runs while sissy practices on dildo, imagining real cock at {location}\n12. Bull lets sissy suck him clean after dumping {loads} loads in wife at {location}\n13. Sissy applies makeup nervously before being allowed in bedroom with couple at {location}\n14. Wife watches sissy ride dildo for {time} minutes, training for the real thing at {location}\n15. Sissy learns her place: fluffer, cleaner, support - never the main event at {location}",
    "links": [],
    "meta": {
      "category": "news-ticker",
      "newsStage": 7,
      "templateCount": 15
    }
  },
  {
    "pid": 152,
    "title": "News: Sissy Devotion",
    "tags": [
      "news-ticker",
      "sissy-path"
    ],
    "body": "News ticker templates for Sissy Devotion:\n\n1. Sissy masters deepthroat after weeks of training, takes {dicksize} inches balls-deep at {location}\n2. Bull finally claims sissy's boycunt, fucks her raw for {time} minutes at {location}\n3. Sissy begs bull to breed her ass, wants to feel his seed inside at {location}\n4. First double penetration: sissy takes {men} cocks at once, screams in pleasure at {location}\n5. Wife and sissy get fucked side by side, both moaning for bull's cock at {location}\n6. Throat training pays off, sissy swallows {dicksize}-inch cock without gagging at {location}\n7. Sissy's boycunt bred properly, {loads} loads pumped deep inside at {location}\n8. Bull uses sissy's throat while another man pounds her ass at {location}\n9. Sissy joins breeding sessions, both holes servicing {men} men alongside wife at {location}\n10. DP session lasts {time} minutes, sissy cumming {orgasms} times hands-free at {location}\n11. Bull and friend spit-roast sissy while wife watches and directs at {location}\n12. Sissy's ass claimed by {dicksize}-inch cock, bred like the slut she is at {location}\n13. Threesome: wife's pussy, sissy's throat, both servicing same bull at {location}\n14. Sissy begs to be bred again, addicted to feeling cum pumped in boycunt at {location}\n15. Group session with {men} bulls, sissy and wife both get fucked thoroughly at {location}",
    "links": [],
    "meta": {
      "category": "news-ticker",
      "newsStage": 8,
      "templateCount": 15
    }
  },
  {
    "pid": 153,
    "title": "News: Sissy Slut",
    "tags": [
      "news-ticker",
      "sissy-path"
    ],
    "body": "News ticker templates for Sissy Slut:\n\n1. Sissy's first gangbang: {men} men take turns on all holes at {location}\n2. SISSY SLUT collar shines while servicing entire bachelor party at {location}\n3. Gangbang lasts {time} minutes, sissy takes {loads} loads in every hole at {location}\n4. Mascara runs in black rivers during brutal gangbang, makeup completely destroyed at {location}\n5. Hands-free sissygasms erupt {orgasms} times during group session at {location}\n6. Weekend gangbang marathon: sissy services {men} different men at {location}\n7. Wife watches sissy get gangbanged, both sluts used by same group at {location}\n8. Lipstick smeared everywhere as {men} cocks take turns face-fucking sissy at {location}\n9. Gangbang leaves sissy gaped and dripping {loads} loads from both holes at {location}\n10. Group of bulls pass sissy around like a toy for {time} minutes at {location}\n11. Public gangbang at {location}, strangers line up to use sissy slut\n12. Sissygasms shake entire body while being gangbanged by {men} men at {location}\n13. Makeup tutorial wasted, face ruined within minutes of gangbang starting at {location}\n14. Cuckold couple hosts gangbang party, sissy and wife both get bred repeatedly at {location}\n15. Marathon gangbang session, sissy loses count after {loads} loads at {location}",
    "links": [],
    "meta": {
      "category": "news-ticker",
      "newsStage": 9,
      "templateCount": 15
    }
  },
  {
    "pid": 154,
    "title": "News: Sissy Cumdump",
    "tags": [
      "news-ticker",
      "sissy-path"
    ],
    "body": "News ticker templates for Sissy Cumdump:\n\n1. Sissy marries bull in beautiful ceremony, wife gives bride away at {location}\n2. Wedding night gangbang: {men} guests breed the sissy bride at {location}\n3. Sissy becomes permanent part of couple's marriage, third in relationship at {location}\n4. Live-in sissy serves couple daily, essential cuckold accessory at {location}\n5. Wedding photos show sissy in white lingerie and veil at {location}\n6. Married sissy's duties: fluff, clean, serve, worship bull husband at {location}\n7. Cuckold accessory assists with all breeding sessions, always present at {location}\n8. Public cumdump bent over at {location}, {men} strangers use the married sissy\n9. Wife and bull treat sissy as shared property, use her {time} minutes daily at {location}\n10. Wedding anniversary gangbang: sissy takes {loads} loads to celebrate at {location}\n11. Sissy wife #2 lives to serve, permanent fixture in cuckold marriage at {location}\n12. Bull's legal sissy bride services his friends whenever ordered at {location}\n13. Married sissy's holes available 24/7 for couple's pleasure at {location}\n14. Permanent cuckold accessory takes {loads} loads while worshipping real marriage at {location}\n15. Wedding vows included obedience, sissy fulfills every promise daily at {location}",
    "links": [],
    "meta": {
      "category": "news-ticker",
      "newsStage": 10,
      "templateCount": 15
    }
  },
  {
    "pid": 155,
    "title": "Random Event:  Gym Encounter",
    "tags": [
      "random-event",
      "stage-0",
      "common-path"
    ],
    "body": "You've been watching her do squats for the past 10 minutes. Her tight yoga pants leave nothing to the imagination, and she knows you're staring. She catches your eye in the mirror and smirks.What do you do?\n\n--- Choice 1: Approach her confidently ---\nYou walk up with a cocky grin and ask if she needs a spotter. She notices your bulge and says 'I do need one.' You stand behind her as she squats onto your bulge until you explode..\n[Essence: +500 | Semen: +50]\n\n--- Choice 2: Keep staring and touch yourself ---\nYou can't help yourself. Your hand drifts to your crotch. She notices and approaches 'You look like you need help' she says grinnning. She pulls out your cock and deepthroats you until you explode in her mouth.\n[Essence: +800 | Semen: +150]\n\n--- Choice 3: Panic and insult her ---\nYou get defensive when she catches you. 'I wasn't even looking at you!' She calls you out loudly. Everyone stares. You're humiliated and leave. Your confidence is shattered.\n[Essence: -300 | Semen: -50]\n\n--- Choice 4: Literally run away ---\nYou grab your bag and sprint out of the gym, tripping over equipment. People laugh. You never go back. Your gym membership is wasted. Your pride is destroyed.\n[Essence: -600 | Semen: -100]",
    "links": [
      "Approach her confidently",
      "Keep staring and touch yourself",
      "Panic and insult her",
      "Literally run away"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "gym_stare",
      "stage": 0,
      "path": "common",
      "choiceCount": 4
    }
  },
  {
    "pid": 156,
    "title": "Random Event:  Late Night Temptation",
    "tags": [
      "random-event",
      "stage-0",
      "common-path"
    ],
    "body": "It's 2 AM and you're home alone, horny as hell. Your laptop is open and you're on the verge of making a decision you might regret.What do you do?\n\n--- Choice 1: Hire an escort ---\nYou call the number from the ad. An hour later, a gorgeous woman is at your door. Best $300 you ever spent. She leaves you drained and satisfied.\n[Essence: +800 | Semen: +150]\n\n--- Choice 2: Hookup with a co-worker ---\nYou ask a co-worker if she's down to fuck and she replies 'I thought you'd never ask!' She arrives and you fuck her for hours and creampie her pussy.\n[Essence: +1,200 | Semen: +250]\n\n--- Choice 3: Text your ex desperately ---\nYou drunk-text your ex begging to come over. She screenshots and shares with friends. Tomorrow you wake up to mocking texts from people who saw. Humiliating.\n[Essence: -400 | Semen: -80]\n\n--- Choice 4: Call everyone in your contacts ---\nYou're so desperate you call friends, coworkers, even your boss asking if they want to 'hang out.' Nobody responds positively. Some block you. Your reputation is ruined.\n[Essence: -800 | Semen: -150]",
    "links": [
      "Hire an escort",
      "Hookup with a co-worker",
      "Text your ex desperately",
      "Call everyone in your contacts"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "late_night_alone",
      "stage": 0,
      "path": "common",
      "choiceCount": 4
    }
  },
  {
    "pid": 157,
    "title": "Random Event:  Bar Conversation",
    "tags": [
      "random-event",
      "stage-0",
      "common-path"
    ],
    "body": "A stunning woman sits next to you at the bar. She orders a drink and glances your way with a playful smile. This is your chance.What do you do?\n\n--- Choice 1: Buy her a drink ---\nShe accepts with a smile. You chat for hours and end up making out then she gives you a blowjob in the parking lot before she leaves for the night.\n[Essence: +600 | Semen: +80]\n\n--- Choice 2: Buy drinks for her and her friends ---\nYou offer to buy the whole group drinks. They all welcome you and find you attractive. Somehow you manage to have a foursome with her and her friends. You blow a load on all their faces.\n[Essence: +1,000 | Semen: +150]\n\n--- Choice 3: Make crude sexual comments ---\nYou try to be 'alpha' but come off as gross. 'Nice tits' is NOT a conversation starter. She throws her drink in your face. The bartender kicks you out.\n[Essence: -500 | Semen: -100]\n\n--- Choice 4: Get aggressive when she rejects you ---\nWhen she politely declines, you get angry. 'You're a bitch anyway!' Security throws you out roughly. You're banned.\n[Essence: -1,000 | Semen: -200]",
    "links": [
      "Buy her a drink",
      "Buy drinks for her and her friends",
      "Make crude sexual comments",
      "Get aggressive when she rejects you"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "bar_conversation",
      "stage": 0,
      "path": "common",
      "choiceCount": 4
    }
  },
  {
    "pid": 158,
    "title": "Random Event:  Locker Room Distraction",
    "tags": [
      "random-event",
      "stage-1",
      "common-path"
    ],
    "body": "You're in the gym locker room changing when a muscular guy walks by naked. Your eyes lock onto his cock. Thick, heavy, hanging low. You can't look away. Your own dick is already shrinking to 4.5 inches and it twitches pathetically.What do you do?\n\n--- Choice 1: Keep staring ---\nYou drink in every detail. He catches you looking and smirks. 'Like what you see?' You turn away quickly, but later you jerk off thinking about his cock. Your 4.5-inch dick barely feels satisfying anymore.\n[Essence: +800 | Semen: +100]\n\n--- Choice 2: Approach and compliment him ---\nYou awkwardly compliment his physique. He's flattered. 'You seem... interested. Want to touch it?' he says with a knowing smile. He pulls out his cock and you hold it, and instinctively jerk him off until he cums. You LOVE touching cock.\n[Essence: +1,200 | Semen: +180]\n\n--- Choice 3: Call him a 'faggot' defensively ---\nYou panic and lash out with slurs. He's hurt and angry. Other guys overheard. You're confronted and kicked out.\n[Essence: -600 | Semen: -120]\n\n--- Choice 4: Report him to management ---\nYou lie and say HE was staring at YOU. Management reviews cameras. They see YOU staring. You're exposed as a liar AND closeted. Humiliated completely.\n[Essence: -1,200 | Semen: -200]",
    "links": [
      "Keep staring",
      "Approach and compliment him",
      "Call him a 'faggot' defensively",
      "Report him to management"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "locker_room_stare",
      "stage": 1,
      "path": "common",
      "choiceCount": 4
    }
  },
  {
    "pid": 159,
    "title": "Random Event:  Bedroom Struggles",
    "tags": [
      "random-event",
      "stage-1",
      "common-path"
    ],
    "body": "Your girlfriend is naked in bed, ready to fuck. But your cock is only 4.5 inches now and barely getting hard. She looks disappointed. 'Is that it?' she asks. Your nipples are getting puffy and sensitive under your shirt.What do you do?\n\n--- Choice 1: Try to fuck her anyway ---\nYou manage to get inside but it's humiliating. She's clearly not satisfied. After a few pathetic thrusts you finish quickly. 'Maybe focus on eating me out,' she suggests. You spend the rest of the night with your face in her pussy.\n[Essence: +600 | Semen: +150]\n\n--- Choice 2: Beg her to finger you ---\nYou admit you can't satisfy her. 'Could you finger my ass...' She's shocked but turned on. She destroys your asshole with her her lubed up fingers, causing you to cum from your cock and all over the bed.\n[Essence: +1,000 | Semen: +250]\n\n--- Choice 3: Blame her and get angry ---\nYou lash out. 'Maybe you're too loose!' She's furious. She kicks you out and texts all your friends about your tiny dick and man-boobs. Everyone knows now.\n[Essence: -700 | Semen: -150]\n\n--- Choice 4: Cry and beg her not to leave ---\nYou break down sobbing, begging, pathetic. She's disgusted. 'This is embarrassing.' She leaves AND posts about it online. Screenshots spread. Your masculinity is publicly destroyed.\n[Essence: -1,400 | Semen: -250]",
    "links": [
      "Try to fuck her anyway",
      "Beg her to finger you",
      "Blame her and get angry",
      "Cry and beg her not to leave"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "girlfriend_disappointment",
      "stage": 1,
      "path": "common",
      "choiceCount": 4
    }
  },
  {
    "pid": 160,
    "title": "Random Event:  Late Night Browsing",
    "tags": [
      "random-event",
      "stage-1",
      "common-path"
    ],
    "body": "It's 3 AM and you're horny. Your usual porn isn't working anymore. You find yourself on a gay porn site, looking at men with huge cocks. Your 4.5-inch dick is leaking precum.What do you do?\n\n--- Choice 1: Watch and jerk off ---\nYou watch videos of men fucking, stroking your shrinking cock. You cum harder than you have in weeks. Post-nut clarity hits but you know you'll be back tomorrow.\n[Essence: +900 | Semen: +130]\n\n--- Choice 2: Create a profile and post pics ---\nYou go all in. Profile created. Shirtless pics showing your puffy nipples. Dick pic showing your 4.5-incher. Messages flood in about how they're going to fuck you. You jerk off to their sexting, cumming harder than ever.\n[Essence: +1,500 | Semen: +220]\n\n--- Choice 3: Clear your history and deny everything ---\nYou panic-delete everything, convince yourself it was just curiosity. But you're lying. The shame eats at you. No release. No acceptance. Just misery and denial.\n[Essence: -800 | Semen: -180]\n\n--- Choice 4: Accidentally send the porn links to your friends AND family ---\nYou try and save the links, but accidentally send them to your contacts. In a moment of insane panic you try to 'prove you're not gay' by forwarding gay porn with comments like 'this is disgusting.' Everyone thinks you're closeted.\n[Essence: -1,600 | Semen: -300]",
    "links": [
      "Watch and jerk off",
      "Create a profile and post pics",
      "Clear your history and deny everything",
      "Accidentally send the porn links to your friends AND family"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "online_curiosity",
      "stage": 1,
      "path": "common",
      "choiceCount": 4
    }
  },
  {
    "pid": 161,
    "title": "Random Event:  Failed Date",
    "tags": [
      "random-event",
      "stage-2",
      "common-path"
    ],
    "body": "You're on a date with a hot girl. But your 4-inch cock can barely get hard. Your chest has small A-cup buds now and your hips have widened. When she feels you up, she pulls back confused. 'Are you... are those tits?'What do you do?\n\n--- Choice 1: Admit it and apologize ---\nYou try explain your body is changing but she isn't hearing it. She leaves. You go home and search on Grindr. The attention on that app makes you leak so much more.\n[Essence: +1,500 | Semen: +100]\n\n--- Choice 2: Strip and show her everything ---\nYou stand up and reveal your body. Small tits, wide hips, 4-inch cock. She's shocked but... curious? 'Can I touch them?' She explores your new body. You end up fooling around anyway.\n[Essence: +2,200 | Semen: +200]\n\n--- Choice 3: Accuse her of being blind ---\n'What are you talking about?' You gaslight her. She's confused and angry. She leaves AND tells all her friends you're weird and delusiona..\n[Essence: -1,000 | Semen: -150]\n\n--- Choice 4: Scream and run away crying ---\nYou have a full meltdown in public. She films it. You're sobbing, running away in shame whilst she sends the video to all her friends.\n[Essence: -2,000 | Semen: -300]",
    "links": [
      "Admit it and apologize",
      "Strip and show her everything",
      "Accuse her of being blind",
      "Scream and run away crying"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "date_failure",
      "stage": 2,
      "path": "common",
      "choiceCount": 4
    }
  },
  {
    "pid": 162,
    "title": "Random Event:  Taking the Plunge",
    "tags": [
      "random-event",
      "stage-2",
      "common-path"
    ],
    "body": "You're in a guy's apartment. He's naked, his 8-inch cock hard and waiting. You stand there, smooth skin, small tits, nervous. Your 4-inch dick is hard too. This is your first time with a man.What do you do?\n\n--- Choice 1: Let him suck you ---\nHe wraps his lips around your cock, a different sensation compared to a woman. Not even 1 minute in, you cum on his tongue, and he swallows it all.\n[Essence: +3,500 | Semen: +350]\n\n--- Choice 2: Suck his cock first ---\nYou drop to your knees and take him in your mouth. He groans as you work his shaft. After a while he starts fucking your throat and blowing a load down it. Cum is so TASTY.\n[Essence: +4,000 | Semen: +400]\n\n--- Choice 3: Panic and say you're not ready ---\n'I can't do this,' you stammer. He's disappointed. You leave with your virginity intact but feeling like you missed your chance. The regret eats at you for days.\n[Essence: -1,500 | Semen: -200]\n\n--- Choice 4: Run away crying ---\nYou have a breakdown and flee his apartment. He texts your mutual friend about how you wasted his time. Everyone hears about the guy who chickened out. Humiliating.\n[Essence: -3,000 | Semen: -350]",
    "links": [
      "Let him suck you",
      "Suck his cock first",
      "Panic and say you're not ready",
      "Run away crying"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "first_cock",
      "stage": 2,
      "path": "common",
      "choiceCount": 4
    }
  },
  {
    "pid": 163,
    "title": "Random Event:  Discovery",
    "tags": [
      "random-event",
      "stage-2",
      "common-path"
    ],
    "body": "Your girlfriend finds gay porn on your laptop. And photos of you with small tits, smooth skin, trying on panties. She's furious and confused. 'What the fuck is this? Are you gay now?'What do you do?\n\n--- Choice 1: Admit everything ---\nYou tell her the truth. Your body is changing. You're attracted to men now. She's disgusted and breaks up with you. Within a week you're giving blowjobs daily to different guys.\n[Essence: +2,000 | Semen: +180]\n\n--- Choice 2: Ask her if you can watch her fuck another man ---\nYou propose to watch her get fucked by another man. She's intrigued. She invites her friend. His 9-inches destroys her pussy in front of you, and you cum hard watching.\n[Essence: +3,000 | Semen: +300]\n\n--- Choice 3: Blame her for 'making you this way' ---\nYou lash out, claiming she turned you gay by being a bad girlfriend. She's livid and breaks up with you before exposing you to friends and family.\n[Essence: -1,800 | Semen: -280]\n\n--- Choice 4: Delete everything and gaslight her ---\nYou delete all evidence while denying everything. 'You're crazy, I was hacked!' But she already took photos. She exposes you publicly with proof. You look insane AND closeted.\n[Essence: -3,500 | Semen: -500]",
    "links": [
      "Admit everything",
      "Ask her if you can watch her fuck another man",
      "Blame her for 'making you this way'",
      "Delete everything and gaslight her"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "girlfriend_discovers",
      "stage": 2,
      "path": "common",
      "choiceCount": 4
    }
  },
  {
    "pid": 164,
    "title": "Random Event:  First Moon",
    "tags": [
      "random-event",
      "stage-3",
      "woman-path"
    ],
    "body": "Your first ovulation as a woman arrives. Your virgin pussy throbs with desperate need. You're ovulating and fertile. Your body screams to be bred for the first time. This isn't just biology, it's overwhelming compulsion.What do you do?\n\n--- Choice 1: Call your male best friend ---\nHe's shocked when you show up at his door with tits and a pussy. But he doesn't ask questions. He takes your virginity right there, filling your womb with his first load. The pain fades quickly to pure pleasure. It feels RIGHT.\n[Essence: +50,000 | Semen: +4,000]\n\n--- Choice 2: Go to a fertility clinic and seduce the doctors ---\nYou lie and say you're there to donate eggs. Instead you seduce two doctors. They take turns claiming your virgin pussy right there in the exam room. Medical professionals pumping seed into your fertile cunt for the first time.\n[Essence: +70,000 | Semen: +6,000]\n\n--- Choice 3: Try to resist the urges with pills ---\nYou take birth control and suppressants. It backfires HARD. Your virgin body rejects them violently. You spend three days in agony, pussy aching unfulfilled. The pain is unbearable.\n[Essence: -30,000 | Semen: -2,000]\n\n--- Choice 4: Lock yourself inside and refuse to leave ---\nYou try to fight nature itself. For a week you stay home, ignoring the need. Your virgin body REBELS. The pain is excruciating. When you finally give in to masturbation, it's not enough. You're still a virgin and miserable.\n[Essence: -80,000 | Semen: -6,000]",
    "links": [
      "Call your male best friend",
      "Go to a fertility clinic and seduce the doctors",
      "Try to resist the urges with pills",
      "Lock yourself inside and refuse to leave"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "first_period_virgin",
      "stage": 3,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 165,
    "title": "Random Event:  Moon Cycle",
    "tags": [
      "random-event",
      "stage-3",
      "woman-path"
    ],
    "body": "Your ovulation arrives again. Your experienced pussy throbs with familiar need. You're ovulating and fertile. You know exactly what your body craves, more seed, more breeding.What do you do?\n\n--- Choice 1: Call your male best friend ---\nHe knows the routine. He comes over and breeds you thoroughly, filling your womb with his load. It's familiar, comfortable, satisfying. Just another breeding session.\n[Essence: +45,000 | Semen: +3,500]\n\n--- Choice 2: Host a breeding party ---\nWhy settle for one? You invite five men over. They take turns breeding your experienced pussy. You collect loads all night, exactly what your fertile body needs.\n[Essence: +65,000 | Semen: +5,500]\n\n--- Choice 3: Try to work through it this time ---\nYou attempt to ignore the urges and be productive. It doesn't work. You're distracted, irritable, unproductive. Your body knows what it needs and won't let you focus.\n[Essence: -25,000 | Semen: -1,500]\n\n--- Choice 4: Take time off and isolate yourself ---\nYou try to fight the urges alone. Days pass in frustration. Your experienced pussy aches for what it's used to. Finally you give in and call someone, but you've wasted precious time.\n[Essence: -70,000 | Semen: -5,000]",
    "links": [
      "Call your male best friend",
      "Host a breeding party",
      "Try to work through it this time",
      "Take time off and isolate yourself"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "first_period_experienced",
      "stage": 3,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 166,
    "title": "Random Event:  Public Discovery",
    "tags": [
      "random-event",
      "stage-3",
      "woman-path"
    ],
    "body": "You're fingering yourself in a public bathroom, virgin pussy dripping. You can't help it - you need release. A woman walks in and catches you. She stares at your hand between your legs, your wetness obvious.What do you do?\n\n--- Choice 1: Apologize and leave quickly ---\nYou try to run. She stops you. 'Wait... are you that guy from work? Holy shit!' She takes a photo. By tomorrow everyone will know you're a woman now. And desperate. Still a virgin though.\n[Essence: +30,000 | Semen: +2,000]\n\n--- Choice 2: Ask if she has a boyfriend ---\n'My boyfriend's outside,' she says. You're shameless now. 'Can he take my virginity?' She's shocked but intrigued. Five minutes later he's taking your virgnity while she watches. Being fucked feels so GOOD.\n[Essence: +70,000 | Semen: +6,000]\n\n--- Choice 3: Threaten her if she tells anyone ---\nYou panic and grab her phone. 'Delete that or else!' She screams. Security comes. You're banned from the mall AND still a desperate virgin.\n[Essence: -40,000 | Semen: -3,000]\n\n--- Choice 4: Deny everything and call her a liar ---\nYou insist she's crazy, that she didn't see anything. She's furious. She makes it her mission to expose you. She contacts your family, your work, EVERYONE. Your virgin desperation becomes public knowledge.\n[Essence: -90,000 | Semen: -7,000]",
    "links": [
      "Apologize and leave quickly",
      "Ask if she has a boyfriend",
      "Threaten her if she tells anyone",
      "Deny everything and call her a liar"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "caught_in_public_virgin",
      "stage": 3,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 167,
    "title": "Random Event:  Public Urge",
    "tags": [
      "random-event",
      "stage-3",
      "woman-path"
    ],
    "body": "You're fingering yourself in a public bathroom, experienced pussy dripping. Old habits die hard. A woman walks in and catches you mid-orgasm. She stares as you finish yourself off.What do you do?\n\n--- Choice 1: Finish and leave casually ---\nYou make eye contact while finishing. No shame. You've done worse. She looks away embarrassed. You wash your hands and leave like nothing happened. Just another day.\n[Essence: +25,000 | Semen: +1,500]\n\n--- Choice 2: Ask if she has a boyfriend ---\n'My boyfriend's outside,' she says. You're shameless now. 'Can he help me?' She's shocked but intrigued. Five minutes later he's pumping you deep while she watches.\n[Essence: +80,000 | Semen: +7,000]\n\n--- Choice 3: Get embarrassed and run ---\nDespite your experience, you still panic. You run out half-dressed. She laughs and tells her friends. They mock you. Even experienced women can be humiliated.\n[Essence: -35,000 | Semen: -2,500]\n\n--- Choice 4: Yell at her for interrupting ---\nYou snap at her. 'Can't you see I'm busy?!' She's offended and reports you to mall security. You're escorted out and banned. Your public antics finally caught up to you.\n[Essence: -80,000 | Semen: -6,000]",
    "links": [
      "Finish and leave casually",
      "Ask if she has a boyfriend",
      "Get embarrassed and run",
      "Yell at her for interrupting"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "caught_in_public_experienced",
      "stage": 3,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 168,
    "title": "Random Event:  New Craving",
    "tags": [
      "random-event",
      "stage-3",
      "woman-path"
    ],
    "body": "You're giving a blowjob as a woman. When he cums, it hits different than you expected. The taste, the texture, the warmth. Your virgin pussy CLENCHES. You need it inside you. Swallowing isn't enough.What do you do?\n\n--- Choice 1: Swallow and demand he fuck you ---\nYou gulp it down then climb on top of him. 'I need it in my pussy now!' He's surprised but eager. You lose your virginity right there, riding him until he cums again, this time where it belongs - inside your fertile cunt.\n[Essence: +70,000 | Semen: +6,000]\n\n--- Choice 2: Keep sucking until he's hard again for round 2 ---\nOne load in your mouth isn't enough. You keep worshipping his cock until he's hard again. Then you guide him into your virgin pussy. The second load goes where nature intended - deep inside you, taking your virginity.\n[Essence: +80,000 | Semen: +7,000]\n\n--- Choice 3: Refuse to swallow and spit it out in disgust ---\nThe taste repulses you. You spit it in his face and push him away. He's offended and leaves. Your virgin pussy throbs unsatisfied. You're still a virgin and miserable.\n[Essence: -35,000 | Semen: -4,000]\n\n--- Choice 4: Vomit and tell him to leave ---\nYou gag and throw up. He's disgusted and angry. 'What the fuck is wrong with you?' He tells everyone you're broken. Your virgin body rejected what it needs. You feel sick for days and you're still unfucked.\n[Essence: -75,000 | Semen: -8,000]",
    "links": [
      "Swallow and demand he fuck you",
      "Keep sucking until he's hard again for round 2",
      "Refuse to swallow and spit it out in disgust",
      "Vomit and tell him to leave"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "taste_test_virgin",
      "stage": 3,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 169,
    "title": "Random Event:  Familiar Taste",
    "tags": [
      "random-event",
      "stage-3",
      "woman-path"
    ],
    "body": "You're giving another blowjob. When he cums, you know exactly what comes next. The taste is familiar now. Your experienced pussy clenches, ready for what it knows is coming.What do you do?\n\n--- Choice 1: Swallow and climb on top ---\nYou gulp it down then mount him without asking. He's still recovering but you don't care. You ride him until he cums again. Two loads collected - one in your mouth, one in your pussy. Perfect.\n[Essence: +65,000 | Semen: +5,500]\n\n--- Choice 2: Work him back up for a proper fuck ---\nYou're an expert now. You keep sucking, using all your skills to get him hard again. Then you take it in your pussy. The second load is always better inside. You've learned that lesson well.\n[Essence: +75,000 | Semen: +6,500]\n\n--- Choice 3: Just swallow and leave ---\nYou finish him off and leave. He's confused - thought you'd want more. Your pussy throbs unsatisfied. You cut the session short for no reason. Wasted opportunity.\n[Essence: -30,000 | Semen: -3,500]\n\n--- Choice 4: Spit it out and complain ---\nEven though you're experienced, you suddenly act picky. 'It tastes bad today.' He's offended. 'You never complained before.' He leaves. Your weird behavior cost you a breeding session.\n[Essence: -70,000 | Semen: -7,000]",
    "links": [
      "Swallow and climb on top",
      "Work him back up for a proper fuck",
      "Just swallow and leave",
      "Spit it out and complain"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "taste_test_experienced",
      "stage": 3,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 170,
    "title": "Random Event:  Nothing Fits",
    "tags": [
      "random-event",
      "stage-4",
      "woman-path"
    ],
    "body": "Your tits have grown to 38DD. Your hips are wide, ass thick. None of your old clothes fit. You're at the mall trying on clothes. Everything makes you look like a pornstar. Men can't stop staring. You're still a virgin in this new body.What do you do?\n\n--- Choice 1: Buy the sluttiest outfits ---\nFuck it. You buy tight dresses, short skirts, crop tops. Your body is built for this. Walking out of the mall, three guys ask for your number.\n[Essence: +120,000 | Semen: +9,000]\n\n--- Choice 2: Ask the sales guy for 'help' in the changing room ---\nThe male employee can't hide his boner. You pull him into the changing room. He doesn't know he's your first. He fucks you against the mirror until he cums in your pussy. You leave wearing nothing but his cum and a new dress, no longer a virgin.\n[Essence: +150,000 | Semen: +12,000]\n\n--- Choice 3: Throw a tantrum and blame the store ---\nYou scream that nothing fits, that it's their fault. Security escorts you out. People film you. The video goes viral. 'Crazy woman has meltdown at mall.' Your shame drains your essence.\n[Essence: -50,000 | Semen: -4,000]\n\n--- Choice 4: Try to force yourself into old male clothes ---\nYou refuse to accept your new body. You buy men's clothes and try to bind your tits, hide your curves. It's agony. The clothes rip. Your transformation REJECTS this denial. You're sick for days.\n[Essence: -110,000 | Semen: -9,000]",
    "links": [
      "Buy the sluttiest outfits",
      "Ask the sales guy for 'help' in the changing room",
      "Throw a tantrum and blame the store",
      "Try to force yourself into old male clothes"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "clothing_problems_virgin",
      "stage": 4,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 171,
    "title": "Random Event:  Nothing Fits",
    "tags": [
      "random-event",
      "stage-4",
      "woman-path"
    ],
    "body": "Your tits have grown to 38DD. Your hips are wide, ass thick. None of your old clothes fit. You're at the mall trying on clothes. Everything makes you look like a pornstar. Men can't stop staring. You know exactly what they're thinking.What do you do?\n\n--- Choice 1: Buy the sluttiest outfits ---\nFuck it. You buy tight dresses, short skirts, crop tops. Your body is built for this. Walking out of the mall, three guys ask for your number.\n[Essence: +120,000 | Semen: +9,000]\n\n--- Choice 2: Ask the sales guy for 'help' in the changing room ---\nThe male employee can't hide his boner. You pull him into the changing room. He fucks you against the mirror, cumming in your pussy. You leave wearing nothing but his cum and a new dress.\n[Essence: +150,000 | Semen: +12,000]\n\n--- Choice 3: Throw a tantrum and blame the store ---\nYou scream that nothing fits, that it's their fault. Security escorts you out. People film you. The video goes viral. 'Crazy woman has meltdown at mall.' Your shame drains your essence.\n[Essence: -50,000 | Semen: -4,000]\n\n--- Choice 4: Try to force yourself into old male clothes ---\nYou refuse to accept your new body. You buy men's clothes and try to bind your tits, hide your curves. It's agony. The clothes rip. Your transformation REJECTS this denial. You're sick for days.\n[Essence: -110,000 | Semen: -9,000]",
    "links": [
      "Buy the sluttiest outfits",
      "Ask the sales guy for 'help' in the changing room",
      "Throw a tantrum and blame the store",
      "Try to force yourself into old male clothes"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "clothing_problems_experienced",
      "stage": 4,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 172,
    "title": "Random Event:  Fertility Contest",
    "tags": [
      "random-event",
      "stage-4",
      "woman-path"
    ],
    "body": "You meet another woman at a party. She's showing off her body, bragging about how many men she's slept with. Your competitive instinct kicks in even though you're still a virgin. You want to prove yourself.What do you do?\n\n--- Choice 1: Challenge her to a competition ---\nYou bet who can collect more loads tonight. She laughs at your virgin confidence. But you're determined. You lose your virginity to the first guy, then collect 8 more loads. She got 12. You lost but you're not a virgin anymore.\n[Essence: +150,000 | Semen: +12,000]\n\n--- Choice 2: Team up for a gangbang ---\nWhy compete? You propose working together. Twenty men line up. Your virginity is taken by the first one, then you take 11 more loads. She took 15. She's more experienced but you did well for your first gangbang.\n[Essence: +170,000 | Semen: +15,000]\n\n--- Choice 3: Get jealous and sabotage her ---\nYou spread rumors that she has an STD. Men avoid her AND you. They think you're both trouble. You stay a virgin and lose essence from your petty behavior.\n[Essence: -60,000 | Semen: -5,000]\n\n--- Choice 4: Attack her physically out of rage ---\nYour virgin insecurity makes you lash out. You slap her. It becomes a fight. Police are called. You're arrested and banned. Still a virgin, now with a record.\n[Essence: -120,000 | Semen: -10,000]",
    "links": [
      "Challenge her to a competition",
      "Team up for a gangbang",
      "Get jealous and sabotage her",
      "Attack her physically out of rage"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "breeding_competition_virgin",
      "stage": 4,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 173,
    "title": "Random Event:  Breeding Challenge",
    "tags": [
      "random-event",
      "stage-4",
      "woman-path"
    ],
    "body": "You meet another woman at a party. She's showing off, bragging about her body count. Your competitive instinct kicks in. You're experienced now - you know you can beat her.What do you do?\n\n--- Choice 1: Challenge her to a competition ---\nYou bet who can collect more loads tonight. Your experience shows. You collect 15 loads to her 12. You WIN decisively. You're the superior breeding vessel.\n[Essence: +180,000 | Semen: +15,000]\n\n--- Choice 2: Team up for a gangbang ---\nWhy compete? You propose working together. Twenty men breed both of you all night. Your experience helps - you took 18 loads to her 14. Even working together, you still WIN.\n[Essence: +200,000 | Semen: +18,000]\n\n--- Choice 3: Get jealous and sabotage her ---\nYou spread rumors about her. But your reputation suffers too. Men think you're both drama. Nobody wants to fuck either of you. Your petty behavior backfires.\n[Essence: -60,000 | Semen: -5,000]\n\n--- Choice 4: Attack her physically out of rage ---\nYou can't handle the competition. You start a fight. Police are called. You're arrested for assault. Your essence crashes from the stupidity.\n[Essence: -120,000 | Semen: -10,000]",
    "links": [
      "Challenge her to a competition",
      "Team up for a gangbang",
      "Get jealous and sabotage her",
      "Attack her physically out of rage"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "breeding_competition_experienced",
      "stage": 4,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 174,
    "title": "Random Event:  Positive Test",
    "tags": [
      "random-event",
      "stage-4",
      "woman-path"
    ],
    "body": "The pregnancy test is positive. You're actually pregnant. You don't even know who the father is - could be any of the dozens of men who've bred you. Your pussy clenches at the thought.What do you do?\n\n--- Choice 1: Keep it and get bred more ---\nPregnancy makes you HORNIER. You fuck more than ever. Being bred while already pregnant feels right. Men love your growing body. You collect loads until you're huge.\n[Essence: +200,000 | Semen: +16,000]\n\n--- Choice 2: Find the father ---\nYou test five potential fathers. It's the one with the biggest cock. You tell him and get fucked. But it's not enough. You invite other men and fuck them too. He watches. Being bred by your baby daddy AND strangers is perfect.\n[Essence: +220,000 | Semen: +18,000]\n\n--- Choice 3: Terminate it and spiral into guilt ---\nYou get an abortion. Immediately you regret it. The guilt is crushing. You can't get aroused for weeks. Your body punishes you. Men sense something is wrong. They avoid you. Your essence withers.\n[Essence: -70,000 | Semen: -6,000]\n\n--- Choice 4: Deny the pregnancy and refuse to deal with it ---\nYou ignore the test, pretend it's not real. But your body knows. You keep fucking, keep drinking. When you finally miscarry from neglect, the trauma is devastating. Essence plummets.\n[Essence: -150,000 | Semen: -12,000]",
    "links": [
      "Keep it and get bred more",
      "Find the father",
      "Terminate it and spiral into guilt",
      "Deny the pregnancy and refuse to deal with it"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "pregnancy_scare",
      "stage": 4,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 175,
    "title": "Random Event:  Brood Mother Awakening",
    "tags": [
      "random-event",
      "stage-5",
      "woman-path"
    ],
    "body": "Your body has changed again. Your tits are massive, constantly leaking. Your hips are wider, ass thicker. You feel an overwhelming urge to breed, to fulfill your purpose. But you're still a virgin. The need is unbearable.What do you do?\n\n--- Choice 1: Seduce a stranger at a club ---\nYou go to a club dressed like a slut. Men swarm you. You pick the most dominant one. In the bathroom, he takes your virginity hard and fast. You cum instantly. Your womb aches to be filled. This is what you were made for.\n[Essence: +200,000 | Semen: +18,000]\n\n--- Choice 2: Post online looking for breeding partners ---\n'Virgin seeking multiple alpha breeders.' Hundreds respond. You pick five. They come to your place and run a train on you. Your virginity is gone. Your womb is full. Perfect.\n[Essence: +250,000 | Semen: +22,000]\n\n--- Choice 3: Try to suppress the urges with medication ---\nYou take suppressants, birth control, anything to stop the need. Your body REJECTS it violently. You're sick for days. The transformation punishes you for resisting. Your essence drains.\n[Essence: -80,000 | Semen: -7,000]\n\n--- Choice 4: Lock yourself away and refuse to give in ---\nYou barricade yourself inside. For a week you resist. The pain is agonizing. Your body screams to be bred. When you finally collapse, you're too weak to move. The denial has devastated you.\n[Essence: -180,000 | Semen: -15,000]",
    "links": [
      "Seduce a stranger at a club",
      "Post online looking for breeding partners",
      "Try to suppress the urges with medication",
      "Lock yourself away and refuse to give in"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "brood_awakening_virgin",
      "stage": 5,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 176,
    "title": "Random Event:  Brood Mother Urges",
    "tags": [
      "random-event",
      "stage-5",
      "woman-path"
    ],
    "body": "Your body has changed again. Your tits are massive, constantly leaking. Your hips are wider, ass thicker. You feel an overwhelming urge to breed, to fulfill your purpose. Your experienced pussy knows exactly what it needs. More seed. More breeding.What do you do?\n\n--- Choice 1: Go to a club and collect loads ---\nYou go to a club dressed like a slut like always. You take the three most attractive men to the bathroom and let them breed you one after another. Your experienced body handles it perfectly. This is what you were made for.\n[Essence: +220,000 | Semen: +20,000]\n\n--- Choice 2: Host a breeding party at home ---\nYou text everyone you know. 'Breeding party at my place. NOW.' Eight men show up. They take turns filling your experienced pussy all night. You're in heaven, collecting load after load. Perfect.\n[Essence: +280,000 | Semen: +26,000]\n\n--- Choice 3: Try to work through the urges ---\nYou attempt to ignore the need and be productive. It doesn't work. You're distracted, irritable, unproductive. Your experienced body knows what it needs and won't let you focus on anything else.\n[Essence: -70,000 | Semen: -6,000]\n\n--- Choice 4: Take suppressants to fight it ---\nYou try medication to stop the urges. Your experienced body REBELS against this. You're violently sick for days. The transformation punishes you for denying your true nature.\n[Essence: -150,000 | Semen: -12,000]",
    "links": [
      "Go to a club and collect loads",
      "Host a breeding party at home",
      "Try to work through the urges",
      "Take suppressants to fight it"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "brood_awakening_experienced",
      "stage": 5,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 177,
    "title": "Random Event:  Medical Examination",
    "tags": [
      "random-event",
      "stage-5",
      "woman-path"
    ],
    "body": "You're at the hospital for a routine checkup. The young, attractive doctor asks you to change into a gown. As he examines you, his hands linger. Your virgin pussy clenches. The examination table is right there.What do you do?\n\n--- Choice 1: Seduce him during the exam ---\n'Doctor, I think you need to examine me more thoroughly.' He's nervous but can't resist. He locks the door and takes your virginity right there on the exam table. Your first time is a medical emergency of lust.\n[Essence: +240,000 | Semen: +22,000]\n\n--- Choice 2: Ask him to bring a colleague ---\nYou suggest he get a second opinion. He brings another doctor. Both examine you thoroughly - very thoroughly. Your virginity is claimed by two medical professionals. A double deflowering in the exam room.\n[Essence: +280,000 | Semen: +26,000]\n\n--- Choice 3: Get flustered and leave early ---\nHis touch makes you nervous. You mumble an excuse and leave before the exam is done. Your virgin body aches unfulfilled. You wasted a perfect opportunity.\n[Essence: -70,000 | Semen: -6,000]\n\n--- Choice 4: Report him for inappropriate touching ---\nYou panic and file a complaint. An investigation begins. He's suspended. You feel guilty - was he really inappropriate or were you just scared? Still a virgin but the guilt consumes you.\n[Essence: -150,000 | Semen: -12,000]",
    "links": [
      "Seduce him during the exam",
      "Ask him to bring a colleague",
      "Get flustered and leave early",
      "Report him for inappropriate touching"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "hospital_checkup_virgin",
      "stage": 5,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 178,
    "title": "Random Event:  Doctor's Appointment",
    "tags": [
      "random-event",
      "stage-5",
      "woman-path"
    ],
    "body": "You're at the hospital for a routine checkup. The young, attractive doctor asks you to change into a gown. As he examines your experienced body, you notice his bulge. The examination table is right there. You know what you want.What do you do?\n\n--- Choice 1: Seduce him during the exam ---\n'Doctor, I need a thorough examination.' You spread your legs wider. He locks the door immediately. He fucks you on the exam table, breeding you right there in his office. Professional misconduct never felt so good.\n[Essence: +220,000 | Semen: +20,000]\n\n--- Choice 2: Request the full staff ---\nYou tell him to bring his colleagues - all of them. Three doctors arrive. They take turns breeding you on the table while the others watch. Medical professionals filling your experienced pussy with their loads.\n[Essence: +270,000 | Semen: +25,000]\n\n--- Choice 3: Just get the exam and leave ---\nFor once you resist. Just a normal checkup. But walking out, your pussy throbs unsatisfied. You had a perfect opportunity and you wasted it. The regret follows you home.\n[Essence: -60,000 | Semen: -5,000]\n\n--- Choice 4: Complain about his professionalism ---\nYou file a complaint that he wasn't professional enough - not sexual enough. The board thinks you're insane. You're banned from the hospital. Your weird complaint ruins everything.\n[Essence: -130,000 | Semen: -10,000]",
    "links": [
      "Seduce him during the exam",
      "Request the full staff",
      "Just get the exam and leave",
      "Complain about his professionalism"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "hospital_checkup_experienced",
      "stage": 5,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 179,
    "title": "Random Event:  Third Hole Awakens",
    "tags": [
      "random-event",
      "stage-5",
      "woman-path"
    ],
    "body": "During foreplay, his finger accidentally slides into your virgin ass. You expect pain. Instead: PLEASURE. Intense, different, amazing. Your ass needs attention too. A whole new hole to explore.What do you do?\n\n--- Choice 1: Demand he finish in your ass ---\n'Put it in my ass!' you beg. He slowly pushes his cock in, taking your anal virginity. Your first anal creampie. It feels wrong and right. Your ass is no longer virgin.\n[Essence: +220,000 | Semen: +20,000]\n\n--- Choice 2: Get double penetrated immediately ---\nYou call his friend over. One cock in your pussy, one taking your anal virginity. They fuck you together, pumping both holes full of cum. You've lost both virginities at once if you were vaginal virgin too.\n[Essence: +260,000 | Semen: +24,000]\n\n--- Choice 3: Pull away scared ---\nThe sensation freaks you out. You pull away. He's disappointed. Your ass throbs, curious but unsatisfied. You missed your chance to explore. Still an anal virgin.\n[Essence: -70,000 | Semen: -6,000]\n\n--- Choice 4: Scream and accuse him of assault ---\nYou panic and accuse him of trying to hurt you. He's shocked and leaves immediately. Word spreads that you're crazy. Your anal virginity remains but at what cost?\n[Essence: -150,000 | Semen: -12,000]",
    "links": [
      "Demand he finish in your ass",
      "Get double penetrated immediately",
      "Pull away scared",
      "Scream and accuse him of assault"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "anal_discovery_virgin",
      "stage": 5,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 180,
    "title": "Random Event:  Anal Session",
    "tags": [
      "random-event",
      "stage-5",
      "woman-path"
    ],
    "body": "You're in the mood for anal. Your experienced ass knows exactly what it wants. He slides in easily - you've done this plenty of times. Your ass clenches around his cock.What do you do?\n\n--- Choice 1: Ride him anal cowgirl ---\nYou mount him reverse, sliding his cock into your experienced ass. You ride him hard. He cums deep in your bowels. Just another anal session for you.\n[Essence: +200,000 | Semen: +18,000]\n\n--- Choice 2: Get DPed with his friend ---\nYou're experienced enough to handle both now. His friend'd cock in your pussy, his cock in your ass. You fuck yourself on both until you cum hard. They fill your holes with their seed.\n[Essence: +240,000 | Semen: +22,000]\n\n--- Choice 3: Change your mind mid-session ---\nHalfway through you decide you don't want anal anymore. He's frustrated - you initiated this. The mood is killed. Wasted opportunity.\n[Essence: -60,000 | Semen: -5,000]\n\n--- Choice 4: Complain it doesn't feel good anymore ---\nYou whine that it's not as good as it used to be. He's offended. 'Then why did you ask for it?' He pulls out and leaves. Your attitude ruined everything.\n[Essence: -130,000 | Semen: -10,000]",
    "links": [
      "Ride him anal cowgirl",
      "Get DPed with his friend",
      "Change your mind mid-session",
      "Complain it doesn't feel good anymore"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "anal_discovery_experienced",
      "stage": 5,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 181,
    "title": "Random Event:  Lactation Incident",
    "tags": [
      "random-event",
      "stage-5",
      "woman-path"
    ],
    "body": "Your massive tits start leaking milk even though you've never been pregnant. It soaks through your shirt in public. A man notices and can't look away. He's clearly aroused by it.What do you do?\n\n--- Choice 1: Invite him home ---\nYou take him to your place. He sucks your milky tits while finger-fucking you. You beg him to take your virginity. He does, pumping you full while drinking your milk. Surreal first time.\n[Essence: +240,000 | Semen: +22,000]\n\n--- Choice 2: Follow him to his car ---\nBold move. In his car, he sucks your leaking tits. You're so turned on you climb on top and lose your virginity right there. He cums inside while drinking your milk. Car sex for your first time.\n[Essence: +260,000 | Semen: +24,000]\n\n--- Choice 3: Run away embarrassed ---\nYou flee home, mortified. Your tits keep leaking. You try to pump the milk out but it just makes more. Still a virgin and now constantly leaking. Miserable.\n[Essence: -80,000 | Semen: -7,000]\n\n--- Choice 4: Yell at him for staring ---\nYou snap at him for looking. Security gets involved. Everyone sees your soaked shirt. You're escorted out while people film. Viral video. Still a virgin but now publicly humiliated.\n[Essence: -160,000 | Semen: -14,000]",
    "links": [
      "Invite him home",
      "Follow him to his car",
      "Run away embarrassed",
      "Yell at him for staring"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "milk_production_virgin",
      "stage": 5,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 182,
    "title": "Random Event:  Milk Leak",
    "tags": [
      "random-event",
      "stage-5",
      "woman-path"
    ],
    "body": "Your massive tits are leaking milk again. It soaks through your shirt in public. A man notices and stares. Your experienced body knows what this means - another breeding opportunity.What do you do?\n\n--- Choice 1: Offer to let him taste ---\nYou're bold now. 'Want some?' He nods eagerly. You take him somewhere private. He sucks your tits while fucking you. He cums inside while drinking. This is routine for you now.\n[Essence: +220,000 | Semen: +20,000]\n\n--- Choice 2: Drag him to your car ---\nYou're experienced and know what you want. In your car, you let him drink while riding him. He fills you up while draining your tits. Efficient breeding session.\n[Essence: +250,000 | Semen: +23,000]\n\n--- Choice 3: Ignore him and go home ---\nFor once you're not interested. You go home to pump. But your pussy aches unfilled. You could've gotten bred but you passed. Regret sets in.\n[Essence: -70,000 | Semen: -6,000]\n\n--- Choice 4: Get angry and defensive ---\nYou snap at him even though you're experienced. 'Stop staring!' He backs off confused. You had an easy breeding opportunity and ruined it with your attitude.\n[Essence: -150,000 | Semen: -13,000]",
    "links": [
      "Offer to let him taste",
      "Drag him to your car",
      "Ignore him and go home",
      "Get angry and defensive"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "milk_production_experienced",
      "stage": 5,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 183,
    "title": "Random Event:  Sacred Temple",
    "tags": [
      "random-event",
      "stage-6",
      "woman-path"
    ],
    "body": "Word has spread about your divine transformation. People worship you now. They've built a temple. Hundreds come daily seeking your 'blessing'. You're still a virgin goddess. They believe taking your virginity grants ultimate power.What do you do?\n\n--- Choice 1: Accept the chosen one ---\nThey hold a ceremony to select who takes your divine virginity. The winner approaches the altar. Thousands watch as he claims you. Your virgin blood becomes a holy relic. You ARE a goddess now.\n[Essence: +450,000 | Semen: +45,000]\n\n--- Choice 2: Perform a virgin breeding ritual ---\nYou announce a public ceremony. Ten 'chosen' men will take your virginity simultaneously in a divine ritual. They breed you for hours on stage. Thousands watch your deflowering. Legendary.\n[Essence: +550,000 | Semen: +55,000]\n\n--- Choice 3: Demand extreme tribute first ---\nYou refuse to lose your divinity cheap. 'Offerings first.' Your greed offends the worshippers. Half leave. Those who stay question your divinity. Your virgin goddess power weakens.\n[Essence: -200,000 | Semen: -20,000]\n\n--- Choice 4: Refuse and denounce them all ---\nSomething snaps. 'I won't be your virgin sacrifice!' You try to shut down the temple. They riot. You've rejected your divine purpose. Your goddess essence withers completely.\n[Essence: -450,000 | Semen: -45,000]",
    "links": [
      "Accept the chosen one",
      "Perform a virgin breeding ritual",
      "Demand extreme tribute first",
      "Refuse and denounce them all"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "fertility_cult_virgin",
      "stage": 6,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 184,
    "title": "Random Event:  Divine Temple",
    "tags": [
      "random-event",
      "stage-6",
      "woman-path"
    ],
    "body": "Word has spread. People worship you now. They've built a temple. Hundreds come daily to 'receive your blessing' which means breeding you. You're an experienced goddess. This is your temple. These are your worshippers.What do you do?\n\n--- Choice 1: Accept all pilgrims ---\nYou lay on the altar. One hundred men per day breed you in religious ceremony. Your womb is their holy grail. They chant and pray as they fill you. You ARE a goddess.\n[Essence: +500,000 | Semen: +50,000]\n\n--- Choice 2: Perform public breeding rituals ---\nYou fuck on stage for thousands. They watch in awe as twenty 'chosen' men breed you. You cum over and over, demonstrating divine pleasure. They scream your name like a prayer.\n[Essence: +600,000 | Semen: +60,000]\n\n--- Choice 3: Demand they pay tribute first ---\nYou refuse to be bred for free. 'Offerings first.' Your greed offends many. Half leave. The temple's power diminishes. Your essence weakens with fewer worshippers.\n[Essence: -200,000 | Semen: -20,000]\n\n--- Choice 4: Denounce them all as perverts ---\nSomething snaps. 'You're all sick! This is wrong!' You try to shut down the temple. They're furious. You've betrayed your own divinity. Your goddess power withers completely.\n[Essence: -450,000 | Semen: -45,000]",
    "links": [
      "Accept all pilgrims",
      "Perform public breeding rituals",
      "Demand they pay tribute first",
      "Denounce them all as perverts"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "fertility_cult_experienced",
      "stage": 6,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 185,
    "title": "Random Event:  Goddess Auction",
    "tags": [
      "random-event",
      "stage-6",
      "woman-path"
    ],
    "body": "Billionaires have heard of you, the virgin goddess. They're bidding BILLIONS for your virginity. Your virgin pussy is the most valuable commodity on earth. One auction to rule them all.What do you do?\n\n--- Choice 1: Auction your virginity ---\nThe bidding war hits $1 billion. An Arab oil sheikh wins. He takes your divine virginity in his palace while servants watch. You're no longer virgin but you're insanely rich and powerful.\n[Essence: +750,000 | Semen: +65,000]\n\n--- Choice 2: Sell to all the top bidders ---\nWhy one? The top ten bidders each pay $10 billion. They take turns claiming your virginity in a marathon session. Your divine deflowering becomes legend. Billions of dollars richer.\n[Essence: +850,000 | Semen: +75,000]\n\n--- Choice 3: Demand impossible prices ---\nYou ask for $1 trillion. Nobody bites. Your virgin goddess status means nothing if nobody can afford you. Isolated and alone, your essence fades.\n[Essence: -250,000 | Semen: -25,000]\n\n--- Choice 4: Refuse all offers ---\n'My virginity is not for sale!' But your body NEEDS it. Your virgin goddess nature requires worship and seed. Denying your purpose causes physical pain. Essence crashes.\n[Essence: -500,000 | Semen: -50,000]",
    "links": [
      "Auction your virginity",
      "Sell to all the top bidders",
      "Demand impossible prices",
      "Refuse all offers"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "monetize_divinity_virgin",
      "stage": 6,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 186,
    "title": "Random Event:  Goddess Business",
    "tags": [
      "random-event",
      "stage-6",
      "woman-path"
    ],
    "body": "You realize your experienced divine power has value. Men pay THOUSANDS for one breeding session with you. Your pussy is the most expensive commodity on earth. You're a billionaire fertility goddess.What do you do?\n\n--- Choice 1: Auction breeding sessions ---\nBillionaires bid millions for one hour with you. You breed with ten ultra-wealthy men per week. Each one pays $5 million. You're the richest woman alive. And the sluttiest.\n[Essence: +800,000 | Semen: +70,000]\n\n--- Choice 2: Start a breeding resort ---\nYou buy an island. Men pay $50,000 per week to visit and try to breed you. Hundreds come. You fuck non-stop. It's paradise - for you and them.\n[Essence: +900,000 | Semen: +80,000]\n\n--- Choice 3: Get greedy and overcharge ---\nYou raise rates to $10 billion per session. Bookings dry up. You're wealthy but isolated. Loneliness and lack of seed weaken your goddess power.\n[Essence: -250,000 | Semen: -25,000]\n\n--- Choice 4: Shut down all operations ---\n'I'm done being used.' But your body NEEDS it. Your goddess nature requires worship and seed. Denying your purpose causes physical pain. Your essence crashes completely.\n[Essence: -500,000 | Semen: -50,000]",
    "links": [
      "Auction breeding sessions",
      "Start a breeding resort",
      "Get greedy and overcharge",
      "Shut down all operations"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "monetize_divinity_experienced",
      "stage": 6,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 187,
    "title": "Random Event:  Virgin Transcendence",
    "tags": [
      "random-event",
      "stage-6",
      "woman-path"
    ],
    "body": "Reality fractures. You see yourself across infinite timelines - in some you're being bred, in others you're still virgin. Time is breaking. You're becoming something MORE. But your virginity anchors you to humanity.What do you do?\n\n--- Choice 1: Lose your virginity to transcend ---\nYou understand now. The final barrier. You manifest a divine entity that takes your virginity. The moment you're no longer virgin, you ascend. You exist across all timelines simultaneously. Goddess achieved.\n[Essence: +1,400,000 | Semen: +140,000]\n\n--- Choice 2: Create a virgin goddess dimension ---\nYou manifest an entire universe where you're the eternal virgin goddess. Every timeline has you, always about to be deflowered but never quite there. Infinite worship, infinite power, eternal virginity.\n[Essence: +1,700,000 | Semen: +170,000]\n\n--- Choice 3: Panic and resist ---\nThe visions terrify you. 'Make it stop!' You fight the transformation. Reality fractures. You're stuck between dimensions. The pain is excruciating. Your virgin essence tears apart.\n[Essence: -400,000 | Semen: -40,000]\n\n--- Choice 4: Reject divinity entirely ---\n'I just want to be normal!' You try to force yourself back. But you're too far gone. Rejecting your divine virgin nature causes catastrophic essence collapse. You lose everything.\n[Essence: -1,000,000 | Semen: -100,000]",
    "links": [
      "Lose your virginity to transcend",
      "Create a virgin goddess dimension",
      "Panic and resist",
      "Reject divinity entirely"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "reality_breaks_virgin",
      "stage": 6,
      "path": "woman",
      "choiceCount": 4
    }
  },
  {
    "pid": 188,
    "title": "Random Event:  Dimensional Ascension",
    "tags": [
      "random-event",
      "stage-6",
      "woman-path"
    ],
    "body": "Something's wrong. Or right? You're being fucked but you're also fucking in the past. And future. You see yourself pregnant with every man who's ever bred you. Time is breaking. You're becoming something MORE.What do you do?\n\n--- Choice 1: Embrace the transcendence ---\nYou let go. Suddenly you exist across all timelines. Every version of you is being bred simultaneously. Millions of cocks, infinite seed. You ARE the eternal breeding goddess.\n[Essence: +1,500,000 | Semen: +150,000]\n\n--- Choice 2: Create your own breeding dimension ---\nWhy limit yourself? You manifest an entire pocket universe where breeding is the only purpose. You rule it. Everyone exists to breed you. Paradise made real.\n[Essence: +1,800,000 | Semen: +180,000]\n\n--- Choice 3: Panic and try to fight it ---\nThe visions terrify you. 'Make it stop!' You resist the transformation. Reality fractures around you. You're stuck between dimensions. The pain is excruciating. Your essence tears apart.\n[Essence: -400,000 | Semen: -40,000]\n\n--- Choice 4: Reject your divinity entirely ---\n'I just want to be normal again!' You try to force yourself back to being human. But you're too far gone. The rejection of your true nature causes a catastrophic essence collapse.\n[Essence: -1,000,000 | Semen: -100,000]",
    "links": [
      "Embrace the transcendence",
      "Create your own breeding dimension",
      "Panic and try to fight it",
      "Reject your divinity entirely"
    ],
    "meta": {
      "category": "random-event",
      "eventId": "reality_breaks_experienced",
      "stage": 6,
      "path": "woman",
      "choiceCount": 4
    }
  }
]